tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define UA                            522
#define R_nW                          523
#define S                             524
#define P                             525
#define D_nA                          526
#define CKE                           527
#define SMP                           528
#define SSP1CON1                      529
#define SSPM0                         530
#define SSPM                          531
#define SSPM1                         532
#define SSPM2                         533
#define SSPM3                         534
#define CKP                           535
#define SSPEN                         536
#define SSPOV                         537
#define WCOL                          538
#define SSP1CON2                      539
#define SSP1CON2_SEN                  540
#define RSEN                          541
#define PEN                           542
#define RCEN                          543
#define ACKEN                         544
#define ACKDT                         545
#define ACKSTAT                       546
#define GCEN                          547
#define SSP1CON3                      548
#define DHEN                          549
#define AHEN                          550
#define SBCDE                         551
#define SDAHT                         552
#define BOEN                          553
#define SCIE                          554
#define PCIE                          555
#define ACKTIM                        556
#define ODCONA                        557
#define ODA0                          558
#define ODA1                          559
#define ODA2                          560
#define ODA4                          561
#define ODA5                          562
#define ODCONC                        563
#define ODC0                          564
#define ODC1                          565
#define ODC2                          566
#define ODC3                          567
#define ODC4                          568
#define ODC5                          569
#define CCPR1L                        570
#define CCPR1L_RL                     571
#define CCPR1H                        572
#define CCPR1H_RH                     573
#define CCP1CON                       574
#define CCP1MODE0                     575
#define CCP1CON_MODE0                 576
#define CCP1CON_MODE                  577
#define CCP1MODE                      578
#define CCP1MODE1                     579
#define CCP1CON_MODE1                 580
#define CCP1MODE2                     581
#define CCP1CON_MODE2                 582
#define CCP1MODE3                     583
#define CCP1CON_MODE3                 584
#define CCP1CON_FMT                   585
#define CCP1FMT                       586
#define CCP1CON_OUT                   587
#define CCP1OUT                       588
#define CCP1EN                        589
#define CCP1CON_EN                    590
#define CCP1CAP                       591
#define CCP1CTS0                      592
#define CCP1CAP_CTS                   593
#define CCP1CAP_CTS0                  594
#define CCP1CTS                       595
#define CCP1CTS1                      596
#define CCP1CAP_CTS1                  597
#define CCP1CTS2                      598
#define CCP1CAP_CTS2                  599
#define CCPR2L                        600
#define CCPR2L_RL                     601
#define CCPR2H                        602
#define CCPR2H_RH                     603
#define CCP2CON                       604
#define CCP2MODE                      605
#define CCP2MODE0                     606
#define CCP2CON_MODE0                 607
#define CCP2CON_MODE                  608
#define CCP2MODE1                     609
#define CCP2CON_MODE1                 610
#define CCP2MODE2                     611
#define CCP2CON_MODE2                 612
#define CCP2MODE3                     613
#define CCP2CON_MODE3                 614
#define CCP2FMT                       615
#define CCP2CON_FMT                   616
#define CCP2OUT                       617
#define CCP2CON_OUT                   618
#define CCP2EN                        619
#define CCP2CON_EN                    620
#define CCP2CAP                       621
#define CCP2CAP_CTS                   622
#define CCP2CAP_CTS0                  623
#define CCP2CTS                       624
#define CCP2CTS0                      625
#define CCP2CAP_CTS1                  626
#define CCP2CTS1                      627
#define CCP2CAP_CTS2                  628
#define CCP2CTS2                      629
#define CCPTMRS                       630
#define CCP1TSEL0                     631
#define CCP1TSEL                      632
#define CCP1TSEL1                     633
#define CCP2TSEL0                     634
#define CCP2TSEL                      635
#define CCP2TSEL1                     636
#define P3TSEL                        637
#define P3TSEL0                       638
#define P3TSEL1                       639
#define P4TSEL0                       640
#define P4TSEL                        641
#define P4TSEL1                       642
#define SLRCONA                       643
#define SLRA0                         644
#define SLRA1                         645
#define SLRA2                         646
#define SLRA4                         647
#define SLRA5                         648
#define SLRCONC                       649
#define SLRC0                         650
#define SLRC1                         651
#define SLRC2                         652
#define SLRC3                         653
#define SLRC4                         654
#define SLRC5                         655
#define INLVLA                        656
#define INLVLA0                       657
#define INLVLA1                       658
#define INLVLA2                       659
#define INLVLA3                       660
#define INLVLA4                       661
#define INLVLA5                       662
#define INLVLC                        663
#define INLVLC0                       664
#define INLVLC1                       665
#define INLVLC2                       666
#define INLVLC3                       667
#define INLVLC4                       668
#define INLVLC5                       669
#define IOCAP                         670
#define IOCAP0                        671
#define IOCAP1                        672
#define IOCAP2                        673
#define IOCAP3                        674
#define IOCAP4                        675
#define IOCAP5                        676
#define IOCAN0                        677
#define IOCAN                         678
#define IOCAN1                        679
#define IOCAN2                        680
#define IOCAN3                        681
#define IOCAN4                        682
#define IOCAN5                        683
#define IOCAF0                        684
#define IOCAF                         685
#define IOCAF1                        686
#define IOCAF2                        687
#define IOCAF3                        688
#define IOCAF4                        689
#define IOCAF5                        690
#define IOCCP                         691
#define IOCCP0                        692
#define IOCCP1                        693
#define IOCCP2                        694
#define IOCCP3                        695
#define IOCCP4                        696
#define IOCCP5                        697
#define IOCCP6                        698
#define IOCCP7                        699
#define IOCCN                         700
#define IOCCN0                        701
#define IOCCN1                        702
#define IOCCN2                        703
#define IOCCN3                        704
#define IOCCN4                        705
#define IOCCN5                        706
#define IOCCN6                        707
#define IOCCN7                        708
#define IOCCF                         709
#define IOCCF0                        710
#define IOCCF1                        711
#define IOCCF2                        712
#define IOCCF3                        713
#define IOCCF4                        714
#define IOCCF5                        715
#define IOCCF6                        716
#define IOCCF7                        717
#define HIDRVC                        718
#define HIDC4                         719
#define HIDC5                         720
#define T4TMR                         721
#define TMR4                          722
#define T4TMR_TMR                     723
#define T4PR_PR                       724
#define T4PR                          725
#define T4CON                         726
#define T4OUTPS0                      727
#define T4CON_OUTPS                   728
#define T4OUTPS                       729
#define T4CON_OUTPS0                  730
#define T4OUTPS1                      731
#define T4CON_OUTPS1                  732
#define T4CON_OUTPS2                  733
#define T4OUTPS2                      734
#define T4OUTPS3                      735
#define T4CON_OUTPS3                  736
#define T4CON_CKPS0                   737
#define T4CKPS0                       738
#define T4CON_CKPS                    739
#define T4CKPS                        740
#define T4CKPS1                       741
#define T4CON_CKPS1                   742
#define T4CKPS2                       743
#define T4CON_CKPS2                   744
#define T4ON                          745
#define T4CON_ON                      746
#define TMR4ON                        747
#define T4HLT                         748
#define T4MODE                        749
#define T4HLT_MODE                    750
#define T4HLT_MODE0                   751
#define T4MODE0                       752
#define T4HLT_MODE1                   753
#define T4MODE1                       754
#define T4HLT_MODE2                   755
#define T4MODE2                       756
#define T4HLT_MODE3                   757
#define T4MODE3                       758
#define T4HLT_MODE4                   759
#define T4MODE4                       760
#define T4CKSYNC                      761
#define T4HLT_CKSYNC                  762
#define T4HLT_CKPOL                   763
#define T4CKPOL                       764
#define T4PSYNC                       765
#define T4HLT_PSYNC                   766
#define T4CLKCON                      767
#define T4CS                          768
#define T4CLKCON_CS                   769
#define T4CS0                         770
#define T4CLKCON_CS0                  771
#define T4CS1                         772
#define T4CLKCON_CS1                  773
#define T4CS2                         774
#define T4CLKCON_CS2                  775
#define T4CS3                         776
#define T4CLKCON_CS3                  777
#define T4RST                         778
#define T4RSEL0                       779
#define T4RSEL                        780
#define T4RST_RSEL                    781
#define T4RST_RSEL0                   782
#define T4RSEL1                       783
#define T4RST_RSEL1                   784
#define T4RSEL2                       785
#define T4RST_RSEL2                   786
#define T4RSEL3                       787
#define T4RST_RSEL3                   788
#define T6TMR                         789
#define TMR6                          790
#define T6TMR_TMR                     791
#define T6PR_PR                       792
#define T6PR                          793
#define T6CON                         794
#define T6CON_OUTPS0                  795
#define T6OUTPS                       796
#define T6CON_OUTPS                   797
#define T6OUTPS0                      798
#define T6CON_OUTPS1                  799
#define T6OUTPS1                      800
#define T6CON_OUTPS2                  801
#define T6OUTPS2                      802
#define T6CON_OUTPS3                  803
#define T6OUTPS3                      804
#define T6CON_CKPS0                   805
#define T6CKPS                        806
#define T6CKPS0                       807
#define T6CON_CKPS                    808
#define T6CON_CKPS1                   809
#define T6CKPS1                       810
#define T6CON_CKPS2                   811
#define T6CKPS2                       812
#define TMR6ON                        813
#define T6ON                          814
#define T6CON_ON                      815
#define T6HLT                         816
#define T6MODE0                       817
#define T6HLT_MODE0                   818
#define T6HLT_MODE                    819
#define T6MODE                        820
#define T6HLT_MODE1                   821
#define T6MODE1                       822
#define T6HLT_MODE2                   823
#define T6MODE2                       824
#define T6HLT_MODE3                   825
#define T6MODE3                       826
#define T6MODE4                       827
#define T6HLT_MODE4                   828
#define T6CKSYNC                      829
#define T6HLT_CKSYNC                  830
#define T6CKPOL                       831
#define T6HLT_CKPOL                   832
#define T6PSYNC                       833
#define T6HLT_PSYNC                   834
#define T6CLKCON                      835
#define T6CS                          836
#define T6CLKCON_CS                   837
#define T6CLKCON_CS0                  838
#define T6CS0                         839
#define T6CLKCON_CS1                  840
#define T6CS1                         841
#define T6CLKCON_CS2                  842
#define T6CS2                         843
#define T6CLKCON_CS3                  844
#define T6CS3                         845
#define T6RST                         846
#define T6RST_RSEL                    847
#define T6RST_RSEL0                   848
#define T6RSEL                        849
#define T6RSEL0                       850
#define T6RST_RSEL1                   851
#define T6RSEL1                       852
#define T6RSEL2                       853
#define T6RST_RSEL2                   854
#define T6RST_RSEL3                   855
#define T6RSEL3                       856
#define TMR3L                         857
#define TMR3H                         858
#define T3CON                         859
#define TMR3ON                        860
#define T3SYNC                        861
#define T3CKPS                        862
#define T3CKPS0                       863
#define T3CKPS1                       864
#define TMR3CS0                       865
#define TMR3CS                        866
#define TMR3CS1                       867
#define T3GCON                        868
#define T3GSS0                        869
#define T3GSS                         870
#define T3GSS1                        871
#define T3GVAL                        872
#define T3GGO_nDONE                   873
#define T3GSPM                        874
#define T3GTM                         875
#define T3GPOL                        876
#define TMR3GE                        877
#define TMR5L                         878
#define TMR5H                         879
#define T5CON                         880
#define TMR5ON                        881
#define T5SYNC                        882
#define T5CKPS                        883
#define T5CKPS0                       884
#define T5CKPS1                       885
#define TMR5CS0                       886
#define TMR5CS                        887
#define TMR5CS1                       888
#define T5GCON                        889
#define T5GSS                         890
#define T5GSS0                        891
#define T5GSS1                        892
#define T5GVAL                        893
#define T5GGO_nDONE                   894
#define T5GSPM                        895
#define T5GTM                         896
#define T5GPOL                        897
#define TMR5GE                        898
#define PID1SETL                      899
#define PID1SET0                      900
#define SET0                          901
#define PID1SET1                      902
#define SET1                          903
#define SET2                          904
#define PID1SET2                      905
#define SET3                          906
#define PID1SET3                      907
#define SET4                          908
#define PID1SET4                      909
#define SET5                          910
#define PID1SET5                      911
#define SET6                          912
#define PID1SET6                      913
#define SET7                          914
#define PID1SET7                      915
#define PID1SETH                      916
#define SET8                          917
#define PID1SET8                      918
#define SET9                          919
#define PID1SET9                      920
#define SET10                         921
#define PID1SET10                     922
#define SET11                         923
#define PID1SET11                     924
#define SET12                         925
#define PID1SET12                     926
#define SET13                         927
#define PID1SET13                     928
#define SET14                         929
#define PID1SET14                     930
#define SET15                         931
#define PID1SET15                     932
#define PID1INL                       933
#define IN0                           934
#define PID1IN0                       935
#define IN1                           936
#define PID1IN1                       937
#define IN2                           938
#define PID1IN2                       939
#define IN3                           940
#define PID1IN3                       941
#define IN4                           942
#define PID1IN4                       943
#define IN5                           944
#define PID1IN5                       945
#define IN6                           946
#define PID1IN6                       947
#define IN7                           948
#define PID1IN7                       949
#define PID1INH                       950
#define IN8                           951
#define PID1IN8                       952
#define IN9                           953
#define PID1IN9                       954
#define PID1IN10                      955
#define IN10                          956
#define PID1IN11                      957
#define IN11                          958
#define PID1IN12                      959
#define IN12                          960
#define PID1IN13                      961
#define IN13                          962
#define PID1IN14                      963
#define IN14                          964
#define IN15                          965
#define PID1IN15                      966
#define PID1K1L                       967
#define K10                           968
#define PID1K10                       969
#define K11                           970
#define PID1K11                       971
#define K12                           972
#define PID1K12                       973
#define K13                           974
#define PID1K13                       975
#define K14                           976
#define PID1K14                       977
#define K15                           978
#define PID1K15                       979
#define K16                           980
#define PID1K16                       981
#define K17                           982
#define PID1K17                       983
#define PID1K1H                       984
#define K18                           985
#define PID1K18                       986
#define K19                           987
#define PID1K19                       988
#define PID1K110                      989
#define K110                          990
#define PID1K111                      991
#define K111                          992
#define PID1K112                      993
#define K112                          994
#define PID1K113                      995
#define K113                          996
#define PID1K114                      997
#define K114                          998
#define PID1K115                      999
#define K115                          1000
#define PID1K2L                       1001
#define K20                           1002
#define PID1K20                       1003
#define K21                           1004
#define PID1K21                       1005
#define K22                           1006
#define PID1K22                       1007
#define K23                           1008
#define PID1K23                       1009
#define K24                           1010
#define PID1K24                       1011
#define K25                           1012
#define PID1K25                       1013
#define K26                           1014
#define PID1K26                       1015
#define K27                           1016
#define PID1K27                       1017
#define PID1K2H                       1018
#define K28                           1019
#define PID1K28                       1020
#define K29                           1021
#define PID1K29                       1022
#define PID1K210                      1023
#define K210                          1024
#define PID1K211                      1025
#define K211                          1026
#define PID1K212                      1027
#define K212                          1028
#define PID1K213                      1029
#define K213                          1030
#define PID1K214                      1031
#define K214                          1032
#define PID1K215                      1033
#define K215                          1034
#define PID1K3L                       1035
#define K30                           1036
#define PID1K30                       1037
#define K31                           1038
#define PID1K31                       1039
#define K32                           1040
#define PID1K32                       1041
#define K33                           1042
#define PID1K33                       1043
#define K34                           1044
#define PID1K34                       1045
#define K35                           1046
#define PID1K35                       1047
#define K36                           1048
#define PID1K36                       1049
#define K37                           1050
#define PID1K37                       1051
#define PID1K3H                       1052
#define K38                           1053
#define PID1K38                       1054
#define PID1K39                       1055
#define K39                           1056
#define K310                          1057
#define PID1K310                      1058
#define K311                          1059
#define PID1K311                      1060
#define K312                          1061
#define PID1K312                      1062
#define K313                          1063
#define PID1K313                      1064
#define K314                          1065
#define PID1K314                      1066
#define K315                          1067
#define PID1K315                      1068
#define PID1OUTLL                     1069
#define OUT0                          1070
#define PID1OUT0                      1071
#define OUT1                          1072
#define PID1OUT1                      1073
#define OUT2                          1074
#define PID1OUT2                      1075
#define OUT3                          1076
#define PID1OUT3                      1077
#define OUT4                          1078
#define PID1OUT4                      1079
#define OUT5                          1080
#define PID1OUT5                      1081
#define OUT6                          1082
#define PID1OUT6                      1083
#define OUT7                          1084
#define PID1OUT7                      1085
#define PID1OUTLH                     1086
#define OUT8                          1087
#define PID1OUT8                      1088
#define OUT9                          1089
#define PID1OUT9                      1090
