tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define PID1OUT10                     1091
#define OUT10                         1092
#define PID1OUT11                     1093
#define OUT11                         1094
#define OUT12                         1095
#define PID1OUT12                     1096
#define OUT13                         1097
#define PID1OUT13                     1098
#define PID1OUT14                     1099
#define OUT14                         1100
#define PID1OUT15                     1101
#define OUT15                         1102
#define PID1OUTHL                     1103
#define PID1OUT16                     1104
#define OUT16                         1105
#define PID1OUT17                     1106
#define OUT17                         1107
#define OUT18                         1108
#define PID1OUT18                     1109
#define OUT19                         1110
#define PID1OUT19                     1111
#define OUT20                         1112
#define PID1OUT20                     1113
#define OUT21                         1114
#define PID1OUT21                     1115
#define OUT22                         1116
#define PID1OUT22                     1117
#define OUT23                         1118
#define PID1OUT23                     1119
#define PID1OUTHH                     1120
#define OUT24                         1121
#define PID1OUT24                     1122
#define OUT25                         1123
#define PID1OUT25                     1124
#define OUT26                         1125
#define PID1OUT26                     1126
#define OUT27                         1127
#define PID1OUT27                     1128
#define OUT28                         1129
#define PID1OUT28                     1130
#define OUT29                         1131
#define PID1OUT29                     1132
#define PID1OUT30                     1133
#define OUT30                         1134
#define OUT31                         1135
#define PID1OUT31                     1136
#define PID1OUTU                      1137
#define OUT32                         1138
#define PID1OUT32                     1139
#define OUT33                         1140
#define PID1OUT33                     1141
#define OUT34                         1142
#define PID1OUT34                     1143
#define OUT35                         1144
#define PID1OUT35                     1145
#define PID1Z1L                       1146
#define PID1Z10                       1147
#define Z10                           1148
#define PID1Z11                       1149
#define Z11                           1150
#define PID1Z12                       1151
#define Z12                           1152
#define PID1Z13                       1153
#define Z13                           1154
#define PID1Z14                       1155
#define Z14                           1156
#define PID1Z15                       1157
#define Z15                           1158
#define PID1Z16                       1159
#define Z16                           1160
#define PID1Z17                       1161
#define Z17                           1162
#define PID1Z1H                       1163
#define Z18                           1164
#define PID1Z18                       1165
#define Z19                           1166
#define PID1Z19                       1167
#define Z110                          1168
#define PID1Z110                      1169
#define Z111                          1170
#define PID1Z111                      1171
#define Z112                          1172
#define PID1Z112                      1173
#define Z113                          1174
#define PID1Z113                      1175
#define Z114                          1176
#define PID1Z114                      1177
#define Z115                          1178
#define PID1Z115                      1179
#define PID1Z1U                       1180
#define Z116                          1181
#define PID1Z116                      1182
#define PID1Z2L                       1183
#define Z20                           1184
#define PID1Z20                       1185
#define Z21                           1186
#define PID1Z21                       1187
#define Z22                           1188
#define PID1Z22                       1189
#define Z23                           1190
#define PID1Z23                       1191
#define Z24                           1192
#define PID1Z24                       1193
#define Z25                           1194
#define PID1Z25                       1195
#define Z26                           1196
#define PID1Z26                       1197
#define Z27                           1198
#define PID1Z27                       1199
#define PID1Z2H                       1200
#define Z28                           1201
#define PID1Z28                       1202
#define Z29                           1203
#define PID1Z29                       1204
#define PID1Z210                      1205
#define Z210                          1206
#define PID1Z211                      1207
#define Z211                          1208
#define PID1Z212                      1209
#define Z212                          1210
#define PID1Z213                      1211
#define Z213                          1212
#define PID1Z214                      1213
#define Z214                          1214
#define PID1Z215                      1215
#define Z215                          1216
#define PID1Z2U                       1217
#define PID1Z216                      1218
#define Z216                          1219
#define PID1ACCLL                     1220
#define PID1ACCLL_ACC0                1221
#define PID1ACC0                      1222
#define PID1ACCLL_ACC1                1223
#define PID1ACC1                      1224
#define PID1ACCLL_ACC2                1225
#define PID1ACC2                      1226
#define PID1ACCLL_ACC3                1227
#define PID1ACC3                      1228
#define PID1ACCLL_ACC4                1229
#define PID1ACC4                      1230
#define PID1ACCLL_ACC5                1231
#define PID1ACC5                      1232
#define PID1ACCLL_ACC6                1233
#define PID1ACC6                      1234
#define PID1ACCLL_ACC7                1235
#define PID1ACC7                      1236
#define PID1ACCLH                     1237
#define PID1ACCLH_ACC8                1238
#define PID1ACC8                      1239
#define PID1ACCLH_ACC9                1240
#define PID1ACC9                      1241
#define PID1ACC10                     1242
#define PID1ACCLH_ACC10               1243
#define PID1ACC11                     1244
#define PID1ACCLH_ACC11               1245
#define PID1ACC12                     1246
#define PID1ACCLH_ACC12               1247
#define PID1ACC13                     1248
#define PID1ACCLH_ACC13               1249
#define PID1ACC14                     1250
#define PID1ACCLH_ACC14               1251
#define PID1ACC15                     1252
#define PID1ACCLH_ACC15               1253
#define PID1ACCHL                     1254
#define PID1ACC16                     1255
#define ACC16                         1256
#define PID1ACC17                     1257
#define ACC17                         1258
#define PID1ACC18                     1259
#define ACC18                         1260
#define PID1ACC19                     1261
#define ACC19                         1262
#define ACC20                         1263
#define PID1ACC20                     1264
#define ACC21                         1265
#define PID1ACC21                     1266
#define ACC22                         1267
#define PID1ACC22                     1268
#define ACC23                         1269
#define PID1ACC23                     1270
#define PID1ACCHH                     1271
#define ACC24                         1272
#define PID1ACC24                     1273
#define ACC25                         1274
#define PID1ACC25                     1275
#define ACC26                         1276
#define PID1ACC26                     1277
#define ACC27                         1278
#define PID1ACC27                     1279
#define ACC28                         1280
#define PID1ACC28                     1281
#define ACC29                         1282
#define PID1ACC29                     1283
#define PID1ACC30                     1284
#define ACC30                         1285
#define ACC31                         1286
#define PID1ACC31                     1287
#define PID1ACCU                      1288
#define ACC32                         1289
#define PID1ACC32                     1290
#define ACC33                         1291
#define PID1ACC33                     1292
#define PID1ACC34                     1293
#define ACC34                         1294
#define PID1CON                       1295
#define PID1CON_MODE0                 1296
#define PID1MODE0                     1297
#define PID1CON_MODE                  1298
#define PID1MODE                      1299
#define PID1CON_MODE1                 1300
#define PID1MODE1                     1301
#define PID1CON_MODE2                 1302
#define PID1MODE2                     1303
#define PID1CON_BUSY                  1304
#define PID1BUSY                      1305
#define PID1EN                        1306
#define PID1CON_EN                    1307
#define PWM3DCL                       1308
#define PWM3DC0                       1309
#define PWM3DCL_PWMPW0                1310
#define PWM3DCL_DC0                   1311
#define PWM3DCL_DC                    1312
#define PWM3DC1                       1313
#define PWM3DCL_PWMPW1                1314
#define PWM3DCL_DC1                   1315
#define PWM3DCH                       1316
#define PWM3DC2                       1317
#define PWM3DCH_DC2                   1318
#define PWM3DCH_DC                    1319
#define PWM3DCH_PWMPW2                1320
#define PWM3DC3                       1321
#define PWM3DCH_DC3                   1322
#define PWM3DCH_PWMPW3                1323
#define PWM3DC4                       1324
#define PWM3DCH_DC4                   1325
#define PWM3DCH_PWMPW4                1326
#define PWM3DC5                       1327
#define PWM3DCH_DC5                   1328
#define PWM3DCH_PWMPW5                1329
#define PWM3DC6                       1330
#define PWM3DCH_DC6                   1331
#define PWM3DCH_PWMPW6                1332
#define PWM3DC7                       1333
#define PWM3DCH_DC7                   1334
#define PWM3DCH_PWMPW7                1335
#define PWM3DC8                       1336
#define PWM3DCH_DC8                   1337
#define PWM3DCH_PWMPW8                1338
#define PWM3DC9                       1339
#define PWM3DCH_DC9                   1340
#define PWM3DCH_PWMPW9                1341
#define PWM3CON                       1342
#define PWM3CON_POL                   1343
#define PWM3POL                       1344
#define PWM3CON_OUT                   1345
#define PWM3OUT                       1346
#define PWM3EN                        1347
#define PWM3CON_EN                    1348
#define PWM4DCL                       1349
#define PWM4DCL_PWMPW0                1350
#define PWM4DCL_DC                    1351
#define PWM4DC0                       1352
#define PWM4DCL_DC0                   1353
#define PWM4DCL_PWMPW1                1354
#define PWM4DC1                       1355
#define PWM4DCL_DC1                   1356
#define PWM4DCH                       1357
#define PWM4DCH_PWMPW2                1358
#define PWM4DCH_DC                    1359
#define PWM4DC2                       1360
#define PWM4DCH_DC2                   1361
#define PWM4DCH_PWMPW3                1362
#define PWM4DC3                       1363
#define PWM4DCH_DC3                   1364
#define PWM4DCH_PWMPW4                1365
#define PWM4DC4                       1366
#define PWM4DCH_DC4                   1367
#define PWM4DCH_PWMPW5                1368
#define PWM4DC5                       1369
#define PWM4DCH_DC5                   1370
#define PWM4DCH_PWMPW6                1371
#define PWM4DC6                       1372
#define PWM4DCH_DC6                   1373
#define PWM4DCH_PWMPW7                1374
#define PWM4DC7                       1375
#define PWM4DCH_DC7                   1376
#define PWM4DCH_PWMPW8                1377
#define PWM4DC8                       1378
#define PWM4DCH_DC8                   1379
#define PWM4DCH_PWMPW9                1380
#define PWM4DC9                       1381
#define PWM4DCH_DC9                   1382
#define PWM4CON                       1383
#define PWM4POL                       1384
#define PWM4CON_POL                   1385
#define PWM4CON_OUT                   1386
#define PWM4OUT                       1387
#define PWM4EN                        1388
#define PWM4CON_EN                    1389
#define CWG1DBR0                      1390
#define CWG1DBR                       1391
#define DBR                           1392
#define DBR0                          1393
#define CWG1DBR1                      1394
#define DBR1                          1395
#define CWG1DBR2                      1396
#define DBR2                          1397
#define CWG1DBR3                      1398
#define DBR3                          1399
#define CWG1DBR4                      1400
#define DBR4                          1401
#define CWG1DBR5                      1402
#define DBR5                          1403
#define CWG1DBF                       1404
#define CWG1DBF0                      1405
#define DBF                           1406
#define DBF0                          1407
#define CWG1DBF1                      1408
#define DBF1                          1409
#define CWG1DBF2                      1410
#define DBF2                          1411
#define CWG1DBF3                      1412
#define DBF3                          1413
#define CWG1DBF4                      1414
#define DBF4                          1415
#define DBF5                          1416
#define CWG1DBF5                      1417
#define CWG1AS0                       1418
#define CWG1LSAC                      1419
#define LSAC                          1420
#define LSAC0                         1421
#define CWG1LSAC0                     1422
#define LSAC1                         1423
#define CWG1LSAC1                     1424
#define LSBD0                         1425
#define CWG1LSBD0                     1426
#define LSBD                          1427
#define CWG1LSBD                      1428
#define LSBD1                         1429
#define CWG1LSBD1                     1430
#define CWG1REN                       1431
#define REN                           1432
#define CWG1SHUTDOWN                  1433
#define SHUTDOWN                      1434
#define CWG1AS1                       1435
#define INAS                          1436
#define CWG1INAS                      1437
#define C1AS                          1438
#define CWG1C1AS                      1439
#define C2AS                          1440
#define CWG1C2AS                      1441
#define TMR2AS                        1442
#define CWG1TMR2AS                    1443
#define CWG1TMR4AS                    1444
#define TMR4AS                        1445
#define CWG1TMR6AS                    1446
#define TMR6AS                        1447
#define CWG1OCON0                     1448
#define CWG1STRA                      1449
#define STRA                          1450
#define STRB                          1451
#define CWG1STRB                      1452
#define CWG1STRC                      1453
#define STRC                          1454
#define CWG1STRD                      1455
#define STRD                          1456
#define OVRA                          1457
#define CWG1OVRA                      1458
#define CWG1OVRB                      1459
#define OVRB                          1460
#define OVRC                          1461
#define CWG1OVRC                      1462
#define OVRD                          1463
#define CWG1OVRD                      1464
#define CWG1CON0                      1465
#define CWG1MODE0                     1466
#define CWG1CON0_MODE0                1467
#define CWG1MODE                      1468
#define CWG1CON0_MODE                 1469
#define CWG1MODE1                     1470
#define CWG1CON0_MODE1                1471
#define CWG1MODE2                     1472
#define CWG1CON0_MODE2                1473
#define LD                            1474
#define CWG1LD                        1475
#define CWG1CON0_EN                   1476
#define CWG1EN                        1477
#define G1EN                          1478
#define CWG1CON1                      1479
#define CWG1POLA                      1480
#define POLA                          1481
#define CWG1POLB                      1482
#define POLB                          1483
#define CWG1POLC                      1484
#define POLC                          1485
#define CWG1POLD                      1486
#define POLD                          1487
#define IN                            1488
#define CWG1IN                        1489
#define CWG1CLKCON                    1490
#define CWG1CLKCON_CS                 1491
#define CWG1CS                        1492
#define CWG1ISM                       1493
#define CWG1IS                        1494
#define IS                            1495
#define IS0                           1496
#define CWG1IS0                       1497
#define CWG1IS1                       1498
#define IS1                           1499
#define IS2                           1500
#define CWG1IS2                       1501
#define IS3                           1502
#define CWG1IS3                       1503
#define WDTCON0                       1504
#define WDTCON0_SEN                   1505
#define SWDTEN                        1506
#define WDTSEN                        1507
#define WDTPS                         1508
#define WDTPS0                        1509
#define WDTPS1                        1510
#define WDTPS2                        1511
#define WDTPS3                        1512
#define WDTPS4                        1513
#define WDTCON1                       1514
#define WDTWINDOW0                    1515
#define WINDOW0                       1516
#define WINDOW                        1517
#define WDTWINDOW                     1518
#define WDTWINDOW1                    1519
#define WINDOW1                       1520
#define WDTWINDOW2                    1521
#define WINDOW2                       1522
#define WDTCS                         1523
#define WDTCS0                        1524
#define WDTCS1                        1525
#define WDTCS2                        1526
#define WDTPSL                        1527
#define WDTPSL_WDTPSCNT               1528
#define WDTPSL_PSCNT                  1529
#define WDTPSCNT0                     1530
#define PSCNT0                        1531
#define WDTPSCNT1                     1532
#define PSCNT1                        1533
#define WDTPSCNT2                     1534
#define PSCNT2                        1535
#define WDTPSCNT3                     1536
#define PSCNT3                        1537
#define WDTPSCNT4                     1538
#define PSCNT4                        1539
#define WDTPSCNT5                     1540
#define PSCNT5                        1541
#define WDTPSCNT6                     1542
#define PSCNT6                        1543
#define WDTPSCNT7                     1544
#define PSCNT7                        1545
#define WDTPSH                        1546
#define PSCNT8                        1547
#define WDTPSH_WDTPSCNT               1548
#define WDTPSH_PSCNT                  1549
#define WDTPSCNT8                     1550
#define PSCNT9                        1551
#define WDTPSCNT9                     1552
#define PSCNT10                       1553
#define WDTPSCNT10                    1554
#define PSCNT11                       1555
#define WDTPSCNT11                    1556
#define PSCNT12                       1557
#define WDTPSCNT12                    1558
#define PSCNT13                       1559
#define WDTPSCNT13                    1560
#define PSCNT14                       1561
#define WDTPSCNT14                    1562
#define PSCNT15                       1563
#define WDTPSCNT15                    1564
#define PSCNT16                       1565
#define WDTPSCNT16                    1566
#define WDTPSCNT17                    1567
#define PSCNT17                       1568
#define STATE                         1569
#define WDTSTATE                      1570
#define WDTTMR                        1571
#define WDTTMR0                       1572
#define WDTTMR1                       1573
#define WDTTMR2                       1574
#define WDTTMR3                       1575
#define WDTTMR4                       1576
#define SCANLADRL                     1577
#define SCANLADRL_LADR                1578
#define LDAR0                         1579
#define SCANLADRL_SCANLADR            1580
#define SCANLADR0                     1581
#define SCANLADR1                     1582
#define LDAR1                         1583
#define LADR2                         1584
#define SCANLADR2                     1585
#define LADR3                         1586
#define SCANLADR3                     1587
#define LADR4                         1588
#define SCANLADR4                     1589
#define LADR5                         1590
#define SCANLADR5                     1591
#define SCANLADR6                     1592
#define LADR6                         1593
#define LADR7                         1594
#define SCANLADR7                     1595
#define SCANLADRH                     1596
#define LADR8                         1597
#define SCANLADRH_SCANLADR            1598
#define SCANLADR8                     1599
#define SCANLADRH_LADR                1600
#define LADR9                         1601
#define SCANLADR9                     1602
#define LADR10                        1603
#define SCANLADR10                    1604
#define SCANLADR11                    1605
#define LADR11                        1606
#define LADR12                        1607
#define SCANLADR12                    1608
#define LADR13                        1609
#define SCANLADR13                    1610
#define LADR14                        1611
#define SCANLADR14                    1612
#define LADR15                        1613
#define SCANLADR15                    1614
#define SCANHADRL                     1615
#define SCANHADR0                     1616
#define HADR0                         1617
#define SCANHADRL_HADR                1618
#define SCANHADRL_SCANHADR            1619
#define SCANHADR1                     1620
#define HADR1                         1621
#define SCANHADR2                     1622
#define HARD2                         1623
#define SCANHADR3                     1624
#define HADR3                         1625
#define SCANHADR4                     1626
#define HADR4                         1627
#define SCANHADR5                     1628
#define HADR5                         1629
#define SCANHADR6                     1630
#define HADR6                         1631
#define SCANHADR7                     1632
#define HADR7                         1633
#define SCANHADRH                     1634
#define HADR8                         1635
#define SCANHADRH_SCANHADR            1636
#define SCANHADR8                     1637
#define SCANHADRH_HADR                1638
#define HADR9                         1639
#define SCANHADR9                     1640
#define HADR10                        1641
#define SCANHADR10                    1642
#define SCANHADR11                    1643
#define HADR11                        1644
#define HADR12                        1645
#define SCANHADR12                    1646
#define HADR13                        1647
#define SCANHADR13                    1648
