tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define HADR14                        1649
#define SCANHADR14                    1650
#define HADR15                        1651
#define SCANHADR15                    1652
#define SCANCON0                      1653
#define SCANMODE                      1654
#define SCANMODE0                     1655
#define SCANCON0_MODE0                1656
#define SCANCON0_MODE                 1657
#define SCANCON0_MODE1                1658
#define SCANMODE1                     1659
#define INTM                          1660
#define SCANINTM                      1661
#define INVALID                       1662
#define SCANINVALID                   1663
#define SCANCON0_BUSY                 1664
#define SCANBUSY                      1665
#define SCANGO                        1666
#define SCANEN                        1667
#define SCANCON0_EN                   1668
#define SCANTRIG                      1669
#define TSEL0                         1670
#define TSEL                          1671
#define SCANTSEL0                     1672
#define SCANTSEL                      1673
#define TSEL1                         1674
#define SCANTSEL1                     1675
#define TSEL2                         1676
#define SCANTSEL2                     1677
#define TSEL3                         1678
#define SCANTSEL3                     1679
#define TSEL4                         1680
#define SCANTSEL4                     1681
#define TSEL5                         1682
#define SCANTSEL5                     1683
#define TSEL6                         1684
#define SCANTSEL6                     1685
#define SCANTSEL7                     1686
#define TSEL7                         1687
#define CRCDATL                       1688
#define CRCDATL_DAT                   1689
#define CRCDAT0                       1690
#define DAT0                          1691
#define CRCDATL_CRCDAT                1692
#define CRCDAT1                       1693
#define DAT1                          1694
#define CRCDAT2                       1695
#define DAT2                          1696
#define CRCDAT3                       1697
#define DAT3                          1698
#define CRCDAT4                       1699
#define DAT4                          1700
#define CRCDAT5                       1701
#define DAT5                          1702
#define CRCDAT6                       1703
#define DAT6                          1704
#define DAT7                          1705
#define CRDCDAT7                      1706
#define CRCDATH                       1707
#define CRCDAT8                       1708
#define DAT8                          1709
#define CRCDATH_CRCDAT                1710
#define CRCDATH_DAT                   1711
#define CRCDAT9                       1712
#define DAT9                          1713
#define DAT10                         1714
#define CRCDAT10                      1715
#define DAT11                         1716
#define CRCDAT11                      1717
#define DAT12                         1718
#define CRCDAT12                      1719
#define DAT13                         1720
#define CRCDAT13                      1721
#define DAT14                         1722
#define CRCDAT14                      1723
#define DAT15                         1724
#define CRCDAT15                      1725
#define CRCACCL                       1726
#define CRCACCL_CRCACC                1727
#define CRCACC0                       1728
#define CRCACCL_ACC0                  1729
#define CRCACCL_ACC                   1730
#define CRCACC1                       1731
#define CRCACCL_ACC1                  1732
#define CRCACC2                       1733
#define CRCACCL_ACC2                  1734
#define CRCACC3                       1735
#define CRCACCL_ACC3                  1736
#define CRCACC4                       1737
#define CRCACCL_ACC4                  1738
#define CRCACC5                       1739
#define CRCACCL_ACC5                  1740
#define CRCACC6                       1741
#define CRCACCL_ACC6                  1742
#define CRCACC7                       1743
#define CRCACCL_ACC7                  1744
#define CRCACCH                       1745
#define CRCACCH_ACC                   1746
#define CRCACCH_CRCACC                1747
#define CRCACC8                       1748
#define CRCACCH_ACC8                  1749
#define CRCACC9                       1750
#define CRCACCH_ACC9                  1751
#define CRCACCH_ACC10                 1752
#define CRCACC10                      1753
#define CRCACCH_ACC11                 1754
#define CRCACC11                      1755
#define CRCACCH_ACC12                 1756
#define CRCACC12                      1757
#define CRCACCH_ACC13                 1758
#define CRCACC13                      1759
#define CRCACCH_ACC14                 1760
#define CRCACC14                      1761
#define CRCACCH_ACC15                 1762
#define CRCACC15                      1763
#define CRCSHIFTL                     1764
#define CRCSHIFTL_CRCSHIFT            1765
#define CRCSHIFTL_SHIFT               1766
#define SHIFT0                        1767
#define CRCSHIFT0                     1768
#define SHIFT1                        1769
#define CRCSHIFT1                     1770
#define SHIFT2                        1771
#define CRCSHIFT2                     1772
#define SHIFT3                        1773
#define CRCSHIFT3                     1774
#define SHIFT4                        1775
#define CRCSHIFT4                     1776
#define SHIFT5                        1777
#define CRCSHIFT5                     1778
#define SHIFT6                        1779
#define CRCSHIFT6                     1780
#define SHIFT7                        1781
#define CRCSHIFT7                     1782
#define CRCSHIFTH                     1783
#define CRCSHIFT8                     1784
#define CRCSHIFTH_SHIFT               1785
#define CRCSHIFTH_CRCSHIFT            1786
#define SHIFT8                        1787
#define CRCSHIFT9                     1788
#define SHIFT9                        1789
#define SHIFT10                       1790
#define CRCSHIFT10                    1791
#define SHIFT11                       1792
#define CRCSHIFT11                    1793
#define SHIFT12                       1794
#define CRCSHIFT12                    1795
#define SHIFT13                       1796
#define CRCSHIFT13                    1797
#define CRCSHIFT14                    1798
#define SHIFT14                       1799
#define SHIFT15                       1800
#define CRCSHIFT15                    1801
#define CRCXORL                       1802
#define XOR1                          1803
#define CRCXOR1                       1804
#define XOR2                          1805
#define CRCXOR2                       1806
#define XOR3                          1807
#define CRCXOR3                       1808
#define XOR4                          1809
#define CRCXOR4                       1810
#define XOR5                          1811
#define CRCXOR5                       1812
#define XOR6                          1813
#define CRCXOR6                       1814
#define XOR7                          1815
#define CRCXOR7                       1816
#define CRCXORH                       1817
#define XOR8                          1818
#define CRCXOR8                       1819
#define XOR9                          1820
#define CRCXOR9                       1821
#define CRCXOR10                      1822
#define XOR10                         1823
#define CRCXOR11                      1824
#define XOR11                         1825
#define XOR12                         1826
#define CRCXOR12                      1827
#define XOR13                         1828
#define CRCXOR13                      1829
#define CRCXOR14                      1830
#define XOR14                         1831
#define CRCXOR15                      1832
#define XOR15                         1833
#define CRCCON0                       1834
#define CRCFULL                       1835
#define FULL                          1836
#define CRCSHIFTM                     1837
#define SHIFTM                        1838
#define ACCM                          1839
#define CRCACCM                       1840
#define CRCCON0_BUSY                  1841
#define CRCBUSY                       1842
#define CRCGO                         1843
#define CRCCON0_EN                    1844
#define CRCEN                         1845
#define CRCCON1                       1846
#define PLEN0                         1847
#define CRCPLEN0                      1848
#define PLEN                          1849
#define CRCPLEN                       1850
#define PLEN1                         1851
#define CRCPLEN1                      1852
#define PLEN2                         1853
#define CRCPLEN2                      1854
#define PLEN3                         1855
#define CRCPLEN3                      1856
#define DLEN                          1857
#define CRCDLEN                       1858
#define CRCDLEN0                      1859
#define DLEN0                         1860
#define DLEN1                         1861
#define CRCDLEN1                      1862
#define CRCDLEN2                      1863
#define DLEN2                         1864
#define DLEN3                         1865
#define CRCDLEN3                      1866
#define AT1RESL                       1867
#define AT1RES0                       1868
#define RES0                          1869
#define RES1                          1870
#define AT1RES1                       1871
#define AT1RES2                       1872
#define RES2                          1873
#define AT1RES3                       1874
#define RES3                          1875
#define AT1RES4                       1876
#define RES4                          1877
#define AT1RES5                       1878
#define RES5                          1879
#define RES6                          1880
#define AT1RES6                       1881
#define AT1RES7                       1882
#define RES7                          1883
#define AT1RESH                       1884
#define RES8                          1885
#define AT1RES8                       1886
#define RES9                          1887
#define AT1RES9                       1888
#define AT1MISSL                      1889
#define AT1MISS0                      1890
#define MISS0                         1891
#define AT1MISS1                      1892
#define MISS1                         1893
#define AT1MISS2                      1894
#define MISS2                         1895
#define AT1MISS3                      1896
#define MISS3                         1897
#define AT1MISS4                      1898
#define MISS4                         1899
#define AT1MISS5                      1900
#define MISS5                         1901
#define AT1MISS6                      1902
#define MISS6                         1903
#define AT1MISS7                      1904
#define MISS7                         1905
#define AT1MISSH                      1906
#define MISS8                         1907
#define AT1MISS8                      1908
#define MISS9                         1909
#define AT1MISS9                      1910
#define MISS10                        1911
#define AT1MISS10                     1912
#define MISS11                        1913
#define AT1MISS11                     1914
#define AT1MISS12                     1915
#define MISS12                        1916
#define AT1MISS13                     1917
#define MISS13                        1918
#define AT1MISS14                     1919
#define MISS14                        1920
#define AT1MISS15                     1921
#define MISS15                        1922
#define AT1PERL                       1923
#define PER0                          1924
#define AT1PER0                       1925
#define PERL0                         1926
#define PER1                          1927
#define AT1PER1                       1928
#define PERL1                         1929
#define PER2                          1930
#define AT1PER2                       1931
#define PERL2                         1932
#define PER3                          1933
#define AT1PER3                       1934
#define PERL3                         1935
#define PER4                          1936
#define AT1PER4                       1937
#define PERL4                         1938
#define PER5                          1939
#define AT1PER5                       1940
#define PERL5                         1941
#define PER6                          1942
#define AT1PER6                       1943
#define PERL6                         1944
#define PER7                          1945
#define AT1PER7                       1946
#define PERL7                         1947
#define AT1PERH                       1948
#define PER8                          1949
#define AT1PER8                       1950
#define PERH0                         1951
#define PER9                          1952
#define AT1PER9                       1953
#define PERH1                         1954
#define AT1PER10                      1955
#define PER10                         1956
#define PERH2                         1957
#define AT1PER11                      1958
#define PER11                         1959
#define PERH3                         1960
#define AT1PER12                      1961
#define PER12                         1962
#define PERH4                         1963
#define AT1PER13                      1964
#define PER13                         1965
#define PERH5                         1966
#define AT1PER14                      1967
#define PER14                         1968
#define PERH6                         1969
#define PER15                         1970
#define AT1POV                        1971
#define PERH7                         1972
#define AT1PHSL                       1973
#define PHS0                          1974
#define AT1PHS0                       1975
#define PHS1                          1976
#define AT1PHS1                       1977
#define PHS2                          1978
#define AT1PHS2                       1979
#define PHS3                          1980
#define AT1PHS3                       1981
#define PHS4                          1982
#define AT1PHS4                       1983
#define PHS5                          1984
#define AT1PHS5                       1985
#define PHS6                          1986
#define AT1PHS6                       1987
#define PHS7                          1988
#define AT1PHS7                       1989
#define AT1PHSH                       1990
#define PHSL8                         1991
#define PHS8                          1992
#define AT1PHS8                       1993
#define PHSL9                         1994
#define PHS9                          1995
#define AT1PHS9                       1996
#define AT1CON0                       1997
#define AT1CON0_MODE                  1998
#define AT1MODE                       1999
#define APMOD                         2000
#define AT1APMOD                      2001
#define AT1CON0_POL                   2002
#define AT1POL                        2003
#define AT1PS0                        2004
#define AT1CON0_PS                    2005
#define AT1PS                         2006
#define AT1CON0_PS0                   2007
#define AT1PS1                        2008
#define AT1CON0_PS1                   2009
#define PREC                          2010
#define AT1PREC                       2011
#define AT1CON0_EN                    2012
#define AT1EN                         2013
#define AT1CON1                       2014
#define AT1VALID                      2015
#define VALID                         2016
#define AT1ACCS                       2017
#define ACCS                          2018
#define MPP                           2019
#define AT1MPP                        2020
#define AT1PRP                        2021
#define PRP                           2022
#define AT1PHP                        2023
#define PHP                           2024
#define AT1IR0                        2025
#define AT1PERIF                      2026
#define AT1MISSIF                     2027
#define AT1PHSIF                      2028
#define AT1IE0                        2029
#define AT1PERIE                      2030
#define AT1MISSIE                     2031
#define AT1PHSIE                      2032
#define AT1IR1                        2033
#define AT1CC1IF                      2034
#define AT1CC2IF                      2035
#define AT1CC3IF                      2036
#define AT1IE1                        2037
#define AT1CC1IE                      2038
#define AT1CC2IE                      2039
#define AT1CC3IE                      2040
#define AT1STPTL                      2041
#define STPT0                         2042
#define AT1STPT0                      2043
#define STPT1                         2044
#define AT1STPT1                      2045
#define STPT2                         2046
#define AT1STPT2                      2047
#define STPT3                         2048
#define AT1STPT3                      2049
#define STPT4                         2050
#define AT1STPT4                      2051
#define STPT5                         2052
#define AT1STPT5                      2053
#define STPT6                         2054
#define AT1STPT6                      2055
#define STPT7                         2056
#define AT1STPT7                      2057
#define AT1STPTH                      2058
#define STPT8                         2059
#define AT1STPT8                      2060
#define STPT9                         2061
#define AT1STPT9                      2062
#define AT1STPT10                     2063
#define STPT10                        2064
#define AT1STPT11                     2065
#define STPT11                        2066
#define AT1STPT12                     2067
#define STPT12                        2068
#define AT1STPT13                     2069
#define STPT13                        2070
#define AT1STPT14                     2071
#define STPT14                        2072
#define AT1ERRL                       2073
#define AT1ERR0                       2074
#define ERR0                          2075
#define ERRL0                         2076
#define AT1ERR1                       2077
#define ERR1                          2078
#define ERRL1                         2079
#define AT1ERR2                       2080
#define ERR2                          2081
#define ERRL2                         2082
#define AT1ERR3                       2083
#define ERR3                          2084
#define ERRL3                         2085
#define AT1ERR4                       2086
#define ERRL4                         2087
#define ERR4                          2088
#define AT1ERR5                       2089
#define ERRL5                         2090
#define ERR5                          2091
#define AT1ERR6                       2092
#define ERRL6                         2093
#define ERR6                          2094
#define AT1ERR7                       2095
#define ERRL7                         2096
#define ERR7                          2097
#define AT1ERRH                       2098
#define AT1ERR8                       2099
#define ERRH0                         2100
#define ERR8                          2101
#define AT1ERR9                       2102
#define ERRH1                         2103
#define ERR9                          2104
#define AT1ERR10                      2105
#define ERR10                         2106
#define ERRH2                         2107
#define AT1ERR11                      2108
#define ERR11                         2109
#define ERRH3                         2110
#define AT1ERR12                      2111
#define ERR12                         2112
#define ERRH4                         2113
#define AT1ERR13                      2114
#define ERR13                         2115
#define ERRH5                         2116
#define AT1ERR14                      2117
#define ERR14                         2118
#define ERRH6                         2119
#define AT1ERR15                      2120
#define ERR15                         2121
#define ERRH7                         2122
#define AT1CLK                        2123
#define AT1CLK_CS                     2124
#define AT1CS                         2125
#define AT1CLK_CS0                    2126
#define AT1CS0                        2127
#define AT1SIG                        2128
#define AT1SSEL0                      2129
#define AT1SIG_SSEL0                  2130
#define AT1SIG_SSEL                   2131
#define AT1SSEL                       2132
#define AT1SSEL1                      2133
#define AT1SIG_SSEL1                  2134
#define AT1SSEL2                      2135
#define AT1SIG_SSEL2                  2136
#define AT1CSEL1                      2137
#define CP1S0                         2138
#define AT1CP1S0                      2139
#define AT1CP1S                       2140
#define CP1S                          2141
#define CP1S1                         2142
#define AT1CP1S1                      2143
#define CP1S2                         2144
#define AT1CP1S2                      2145
#define AT1CC1L                       2146
#define AT1CC10                       2147
#define CC10                          2148
#define AT1CC11                       2149
#define CC11                          2150
#define AT1CC12                       2151
#define CC12                          2152
#define AT1CC1L_CC13                  2153
#define AT1CC13                       2154
#define AT1CC14                       2155
#define CC14                          2156
#define AT1CC15                       2157
#define CC15                          2158
#define AT1CC16                       2159
#define CC16                          2160
#define AT1CC17                       2161
#define CC17                          2162
#define AT1CC1H                       2163
#define CC18                          2164
#define AT1CC18                       2165
#define CC19                          2166
#define AT1CC19                       2167
#define AT1CCON1                      2168
#define AT1CC1MODE                    2169
#define CC1MODE                       2170
#define CAP1P                         2171
#define AT1CAP1P                      2172
#define CC1POL                        2173
#define AT1CC1POL                     2174
#define AT1CC1EN                      2175
#define CC1EN                         2176
#define AT1CSEL2                      2177
#define AT1CP2S0                      2178
#define AT1CP2S                       2179
#define CP2S0                         2180
#define CP2S                          2181
#define CP2S1                         2182
#define AT1CP2S1                      2183
#define AT1CP2S2                      2184
#define CP2S2                         2185
#define AT1CC2L                       2186
#define AT1CC20                       2187
#define CC20                          2188
#define AT1CC21                       2189
#define CC21                          2190
#define AT1CC22                       2191
#define CC22                          2192
#define AT1CC23                       2193
#define AT1CC2L_CC13                  2194
#define AT1CC24                       2195
#define CC24                          2196
#define AT1CC25                       2197
#define CCW5                          2198
#define AT1CC26                       2199
#define CC26                          2200
#define AT1CC27                       2201
#define CC27                          2202
#define AT1CC2H                       2203
#define CC28                          2204
#define AT1CC28                       2205
#define CC29                          2206
