tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define AT1CC29                       2207
#define AT1CCON2                      2208
#define CC2MODE                       2209
#define AT1CC2MODE                    2210
#define AT1CAP2P                      2211
#define CAP2P                         2212
#define AT1CC2POL                     2213
#define CC2POL                        2214
#define CC2EN                         2215
#define AT1CC2EN                      2216
#define AT1CSEL3                      2217
#define CP3S0                         2218
#define AT1CP3S                       2219
#define AT1CP3S0                      2220
#define CP3S                          2221
#define CP3S1                         2222
#define AT1CP3S1                      2223
#define CP3S2                         2224
#define AT1CP3S2                      2225
#define AT1CC3L                       2226
#define AT1CC30                       2227
#define CC30                          2228
#define AT1CC31                       2229
#define CC31                          2230
#define AT1CC32                       2231
#define CC32                          2232
#define AT1CC33                       2233
#define CC33                          2234
#define AT1CC34                       2235
#define CC34                          2236
#define AT1CC35                       2237
#define CC35                          2238
#define AT1CC36                       2239
#define CC36                          2240
#define AT1CC37                       2241
#define CC37                          2242
#define AT1CC3H                       2243
#define CC38                          2244
#define AT1CC38                       2245
#define CC39                          2246
#define AT1CC39                       2247
#define AT1CCON3                      2248
#define AT1CC3MODE                    2249
#define CC3MODE                       2250
#define AT1CAP3P                      2251
#define CAP3P                         2252
#define AT1CC3POL                     2253
#define CC3POL                        2254
#define CC3EN                         2255
#define AT1CC3EN                      2256
#define SMT1TMRL                      2257
#define SMT1TMR0                      2258
#define SMT1TMRL_SMT1TMR              2259
#define SMT1TMR1                      2260
#define SMT1TMR2                      2261
#define SMT1TMR3                      2262
#define SMT1TMR4                      2263
#define SMT1TMR5                      2264
#define SMT1TMR6                      2265
#define SMT1TMR7                      2266
#define SMT1TMRH                      2267
#define SMT1TMR8                      2268
#define SMT1TMRH_SMT1TMR              2269
#define SMT1TMR9                      2270
#define SMT1TMR10                     2271
#define SMT1TMR11                     2272
#define SMT1TMR12                     2273
#define SMT1TMR13                     2274
#define SMT1TMR14                     2275
#define SMT1TMR15                     2276
#define SMT1TMRU                      2277
#define SMT1TMR16                     2278
#define SMT1TMRU_SMT1TMR              2279
#define SMT1TMR17                     2280
#define SMT1TMR18                     2281
#define SMT1TMR19                     2282
#define SMT1TMR20                     2283
#define SMT1TMR21                     2284
#define SMT1TMR22                     2285
#define SMT1TMR23                     2286
#define SMT1CPRL                      2287
#define SMT1CPRL_SMT1CPR              2288
#define SMT1CPR0                      2289
#define SMT1CPR1                      2290
#define SMT1CPR2                      2291
#define SMT1CPR3                      2292
#define SMT1CPR4                      2293
#define SMT1CPR5                      2294
#define SMT1CPR6                      2295
#define SMT1CPR7                      2296
#define SMT1CPRH                      2297
#define SMT1CPRH_SMT1CPR              2298
#define SMT1CPR8                      2299
#define SMT1CPR9                      2300
#define SMT1CPR10                     2301
#define SMT1CPR11                     2302
#define SMT1CPR12                     2303
#define SMT1CPR13                     2304
#define SMT1CPR14                     2305
#define SMT1CPR15                     2306
#define SMT1CPRU                      2307
#define SMT1CPR16                     2308
#define SMT1CPRU_SMT1CPR              2309
#define SMT1CPR17                     2310
#define SMT1CPR18                     2311
#define SMT1CPR19                     2312
#define SMT1CPR20                     2313
#define SMT1CPR21                     2314
#define SMT1CPR22                     2315
#define SMT1CPR23                     2316
#define SMT1CPWL                      2317
#define SMT1CPW0                      2318
#define SMT1CPWL_SMT1CPW              2319
#define SMT1CPW1                      2320
#define SMT1CPW2                      2321
#define SMT1CPW3                      2322
#define SMT1CPW4                      2323
#define SMT1CPW5                      2324
#define SMT1CPW6                      2325
#define SMT1CPW7                      2326
#define SMT1CPWH                      2327
#define SMT1CPW8                      2328
#define SMT1CPWH_SMT1CPW              2329
#define SMT1CPW9                      2330
#define SMT1CPW10                     2331
#define SMT1CPW11                     2332
#define SMT1CPW12                     2333
#define SMT1CPW13                     2334
#define SMT1CPW14                     2335
#define SMT1CPW15                     2336
#define SMT1CPWU                      2337
#define SMT1CPWU_SMT1CPW              2338
#define SMT1CPW16                     2339
#define SMT1CPW17                     2340
#define SMT1CPW18                     2341
#define SMT1CPW19                     2342
#define SMT1CPW20                     2343
#define SMT1CPW21                     2344
#define SMT1CPW22                     2345
#define SMT1CPW23                     2346
#define SMT1PRL                       2347
#define SMT1PR0                       2348
#define SMT1PRL_SMT1PR                2349
#define SMT1PR1                       2350
#define SMT1PR2                       2351
#define SMT1PR3                       2352
#define SMT1PR4                       2353
#define SMT1PR5                       2354
#define SMT1PR6                       2355
#define SMT1PR7                       2356
#define SMT1PRH                       2357
#define SMT1PR8                       2358
#define SMT1PRH_SMT1PR                2359
#define SMT1PR9                       2360
#define SMT1PR10                      2361
#define SMT1PR11                      2362
#define SMT1PR12                      2363
#define SMT1PR13                      2364
#define SMT1PR14                      2365
#define SMT1PR15                      2366
#define SMT1PRU                       2367
#define SMT1PR16                      2368
#define SMT1PRU_SMT1PR                2369
#define SMT1PR17                      2370
#define SMT1PR18                      2371
#define SMT1PR19                      2372
#define SMT1PR20                      2373
#define SMT1PR21                      2374
#define SMT1PR22                      2375
#define SMT1PR23                      2376
#define SMT1CON0                      2377
#define SMT1PS0                       2378
#define SMT1PS                        2379
#define SMT1PS1                       2380
#define SMT1CON0_CPOL                 2381
#define SMT1CON0_SPOL                 2382
#define SMT1CON0_WPOL                 2383
#define SMT1CON0_STP                  2384
#define SMT1CON0_EN                   2385
#define SMT1CON1                      2386
#define SMT1MODE0                     2387
#define SMT1CON1_MODE                 2388
#define SMT1CON1_MODE0                2389
#define SMT1MODE                      2390
#define SMT1CON1_MODE1                2391
#define SMT1MODE1                     2392
#define SMT1CON1_MODE2                2393
#define SMT1MODE2                     2394
#define SMT1CON1_MODE3                2395
#define SMT1MODE3                     2396
#define SMT1CON1_REPEAT               2397
#define SMT1REPEAT                    2398
#define SMT1GO                        2399
#define SMT1STAT                      2400
#define SMT1STAT_AS                   2401
#define SMT1AS                        2402
#define SMT1STAT_WS                   2403
#define SMT1WS                        2404
#define SMT1STAT_TS                   2405
#define SMT1TS                        2406
#define SMT1RESET                     2407
#define SMT1STAT_RST                  2408
#define SMT1CPWUP                     2409
#define SMT1STAT_CPWUP                2410
#define SMT1CPRUP                     2411
#define SMT1STAT_CPRUP                2412
#define SMT1CLK                       2413
#define SMT1CLK_CSEL0                 2414
#define SMT1CSEL0                     2415
#define SMT1CSEL                      2416
#define SMT1CLK_CSEL                  2417
#define SMT1CSEL1                     2418
#define SMT1CLK_CSEL1                 2419
#define SMT1CSEL2                     2420
#define SMT1CLK_CSEL2                 2421
#define SMT1SIG                       2422
#define SMT1SSEL                      2423
#define SMT1SIG_SSEL0                 2424
#define SMT1SIG_SSEL                  2425
#define SMT1SSEL0                     2426
#define SMT1SIG_SSEL1                 2427
#define SMT1SSEL1                     2428
#define SMT1SIG_SSEL2                 2429
#define SMT1SSEL2                     2430
#define SMT1SIG_SSEL3                 2431
#define SMT1SSEL3                     2432
#define SMT1SIG_SSEL4                 2433
#define SMT1SSEL4                     2434
#define SMT1WIN                       2435
#define SMT1WSEL                      2436
#define SMT1WSEL0                     2437
#define SMT1WIN_WSEL0                 2438
#define SMT1WIN_WSEL                  2439
#define SMT1WSEL1                     2440
#define SMT1WIN_WSEL1                 2441
#define SMT1WIN_WSEL2                 2442
#define SMT1WSEL2                     2443
#define SMT1WIN_WSEL3                 2444
#define SMT1WSEL3                     2445
#define SMT1WIN_WSEL4                 2446
#define SMT1WSEL4                     2447
#define SMT2TMRL                      2448
#define SMT2TMRL_SMT2TMR              2449
#define SMT2TMR0                      2450
#define SMT2TMR1                      2451
#define SMT2TMR2                      2452
#define SMT2TMR3                      2453
#define SMT2TMR4                      2454
#define SMT2TMR5                      2455
#define SMT2TMR6                      2456
#define SMT2TMR7                      2457
#define SMT2TMRH                      2458
#define SMT2TMR8                      2459
#define SMT2TMRH_SMT2TMR              2460
#define SMT2TMR9                      2461
#define SMT2TMR10                     2462
#define SMT2TMR11                     2463
#define SMT2TMR12                     2464
#define SMT2TMR13                     2465
#define SMT2TMR14                     2466
#define SMT2TMR15                     2467
#define SMT2TMRU                      2468
#define SMT2TMR16                     2469
#define SMT2TMRU_SMT2TMR              2470
#define SMT2TMR17                     2471
#define SMT2TMR18                     2472
#define SMT2TMR19                     2473
#define SMT2TMR20                     2474
#define SMT2TMR21                     2475
#define SMT2TMR22                     2476
#define SMT2TMR23                     2477
#define SMT2CPRL                      2478
#define SMT2CPRL_SMT2CPR              2479
#define SMT2CPR0                      2480
#define SMT2CPR1                      2481
#define SMT2CPR2                      2482
#define SMT2CPR3                      2483
#define SMT2CPR4                      2484
#define SMT2CPR5                      2485
#define SMT2CPR6                      2486
#define SMT2CPR7                      2487
#define SMT2CPRH                      2488
#define SMT2CPR8                      2489
#define SMT2CPRH_SMT2CPR              2490
#define SMT2CPR9                      2491
#define SMT2CPR10                     2492
#define SMT2CPR11                     2493
#define SMT2CPR12                     2494
#define SMT2CPR13                     2495
#define SMT2CPR14                     2496
#define SMT2CPR15                     2497
#define SMT2CPRU                      2498
#define SMT2CPRU_SMT2CPR              2499
#define SMT2CPR16                     2500
#define SMT2CPR17                     2501
#define SMT2CPR18                     2502
#define SMT2CPR19                     2503
#define SMT2CPR20                     2504
#define SMT2CPR21                     2505
#define SMT2CPR22                     2506
#define SMT2CPR23                     2507
#define SMT2CPWL                      2508
#define SMT2CPWL_SMT2CPW              2509
#define SMT2CPW0                      2510
#define SMT2CPW1                      2511
#define SMT2CPW2                      2512
#define SMT2CPW3                      2513
#define SMT2CPW4                      2514
#define SMT2CPW5                      2515
#define SMT2CPW6                      2516
#define SMT2CPW7                      2517
#define SMT2CPWH                      2518
#define SMT2CPWH_SMT2CPW              2519
#define SMT2CPW8                      2520
#define SMT2CPW9                      2521
#define SMT2CPW10                     2522
#define SMT2CPW11                     2523
#define SMT2CPW12                     2524
#define SMT2CPW13                     2525
#define SMT2CPW14                     2526
#define SMT2CPW15                     2527
#define SMT2CPWU                      2528
#define SMT2CPWU_SMT2CPW              2529
#define SMT2CPW16                     2530
#define SMT2CPW17                     2531
#define SMT2CPW18                     2532
#define SMT2CPW19                     2533
#define SMT2CPW20                     2534
#define SMT2CPW21                     2535
#define SMT2CPW22                     2536
#define SMT2CPW23                     2537
#define SMT2PRL                       2538
#define SMT2PRL_SMT2PR                2539
#define SMT2PR0                       2540
#define SMT2PR1                       2541
#define SMT2PR2                       2542
#define SMT2PR3                       2543
#define SMT2PR4                       2544
#define SMT2PR5                       2545
#define SMT2PR6                       2546
#define SMT2PR7                       2547
#define SMT2PRH                       2548
#define SMT2PRH_SMT2PR                2549
#define SMT2PR8                       2550
#define SMT2PR9                       2551
#define SMT2PR10                      2552
#define SMT2PR11                      2553
#define SMT2PR12                      2554
#define SMT2PR13                      2555
#define SMT2PR14                      2556
#define SMT2PR15                      2557
#define SMT2PRU                       2558
#define SMT2PRU_SMT2PR                2559
#define SMT2PR16                      2560
#define SMT2PR17                      2561
#define SMT2PR18                      2562
#define SMT2PR19                      2563
#define SMT2PR20                      2564
#define SMT2PR21                      2565
#define SMT2PR22                      2566
#define SMT2PR23                      2567
#define SMT2CON0                      2568
#define SMT2PS0                       2569
#define SMT2PS                        2570
#define SMT2PS1                       2571
#define SMT2CON0_CPOL                 2572
#define SMT2CON0_SPOL                 2573
#define SMT2CON0_WPOL                 2574
#define SMT2CON0_STP                  2575
#define SMT2CON0_EN                   2576
#define SMT2CON1                      2577
#define SMT2CON1_MODE                 2578
#define SMT2CON1_MODE0                2579
#define SMT2MODE0                     2580
#define SMT2MODE                      2581
#define SMT2CON1_MODE1                2582
#define SMT2MODE1                     2583
#define SMT2CON1_MODE2                2584
#define SMT2MODE2                     2585
#define SMT2CON1_MODE3                2586
#define SMT2MODE3                     2587
#define SMT2REPEAT                    2588
#define SMT2CON1_REPEAT               2589
#define SMT2GO                        2590
#define SMT2STAT                      2591
#define SMT2AS                        2592
#define SMT2STAT_AS                   2593
#define SMT2WS                        2594
#define SMT2STAT_WS                   2595
#define SMT2STAT_TS                   2596
#define SMT2TS                        2597
#define SMT2RESET                     2598
#define SMT2STAT_RST                  2599
#define SMT2CPWUP                     2600
#define SMT2STAT_CPWUP                2601
#define SMT2STAT_CPRUP                2602
#define SMT2CPRUP                     2603
#define SMT2CLK                       2604
#define SMT2CLK_CSEL                  2605
#define SMT2CLK_CSEL0                 2606
#define SMT2CSEL0                     2607
#define SMT2CSEL                      2608
#define SMT2CLK_CSEL1                 2609
#define SMT2CSEL1                     2610
#define SMT2CLK_CSEL2                 2611
#define SMT2CSEL2                     2612
#define SMT2SIG                       2613
#define SMT2SIG_SSEL                  2614
#define SMT2SSEL0                     2615
#define SMT2SSEL                      2616
#define SMT2SIG_SSEL0                 2617
#define SMT2SSEL1                     2618
#define SMT2SIG_SSEL1                 2619
#define SMT2SSEL2                     2620
#define SMT2SIG_SSEL2                 2621
#define SMT2SIG_SSEL3                 2622
#define SMT2SSEL3                     2623
#define SMT2SSEL4                     2624
#define SMT2SIG_SSEL4                 2625
#define SMT2WIN                       2626
#define SMT2WIN_WSEL0                 2627
#define SMT2WSEL0                     2628
#define SMT2WSEL                      2629
#define SMT2WIN_WSEL                  2630
#define SMT2WSEL1                     2631
#define SMT2WIN_WSEL1                 2632
#define SMT2WSEL2                     2633
#define SMT2WIN_WSEL2                 2634
#define SMT2WSEL3                     2635
#define SMT2WIN_WSEL3                 2636
#define SMT2WSEL4                     2637
#define SMT2WIN_WSEL4                 2638
#define PPSLOCK                       2639
#define PPSLOCKED                     2640
#define INTPPS                        2641
#define INTPPS0                       2642
#define INTPPS1                       2643
#define INTPPS2                       2644
#define INTPPS3                       2645
#define INTPPS4                       2646
#define T0CKIPPS                      2647
#define T0CKIPPS0                     2648
#define T0CKIPPS1                     2649
#define T0CKIPPS2                     2650
#define T0CKIPPS3                     2651
#define T0CKIPPS4                     2652
#define T1CKIPPS                      2653
#define T1CKIPPS0                     2654
#define T1CKIPPS1                     2655
#define T1CKIPPS2                     2656
#define T1CKIPPS3                     2657
#define T1CKIPPS4                     2658
#define T1GPPS                        2659
#define T1GPPS0                       2660
#define T1GPPS1                       2661
#define T1GPPS2                       2662
#define T1GPPS3                       2663
#define T1GPPS4                       2664
#define CCP1PPS                       2665
#define CCP1PPS0                      2666
#define CCP1PPS1                      2667
#define CCP1PPS2                      2668
#define CCP1PPS3                      2669
#define CCP1PPS4                      2670
#define CCP2PPS                       2671
#define CCP2PPS0                      2672
#define CCP2PPS1                      2673
#define CCP2PPS2                      2674
#define CCP2PPS3                      2675
#define CCP2PPS4                      2676
#define ATINPPS                       2677
#define ATINPPS0                      2678
#define ATINPPS1                      2679
#define ATINPPS2                      2680
#define ATINPPS3                      2681
#define ATINPPS4                      2682
#define CWGINPPS                      2683
#define CWGINPPS0                     2684
#define CWGINPPS1                     2685
#define CWGINPPS2                     2686
#define CWGINPPS3                     2687
#define CWGINPPS4                     2688
#define T2PPS                         2689
#define T2PPS0                        2690
#define T2PPS1                        2691
#define T2PPS2                        2692
#define T2PPS3                        2693
#define T2PPS4                        2694
#define T3CKIPPS                      2695
#define T3CKIPPS0                     2696
#define T3CKIPPS1                     2697
#define T3CKIPPS2                     2698
#define T3CKIPPS3                     2699
#define T3CKIPPS4                     2700
#define T3GPPS                        2701
#define T3GPPS0                       2702
#define T3GPPS1                       2703
#define T3GPPS2                       2704
#define T3GPPS3                       2705
#define T3GPPS4                       2706
#define T4PPS                         2707
#define T4PPS0                        2708
#define T4PPS1                        2709
#define T4PPS2                        2710
#define T4PPS3                        2711
#define T4PPS4                        2712
#define T5CKIPPS                      2713
#define T5CKIPPS0                     2714
#define T5CKIPPS1                     2715
#define T5CKIPPS2                     2716
#define T5CKIPPS3                     2717
#define T5CKIPPS4                     2718
#define T5GPPS                        2719
#define T5GPPS0                       2720
#define T5GPPS1                       2721
#define T5GPPS2                       2722
#define T5GPPS3                       2723
#define T5GPPS4                       2724
#define T6PPS                         2725
#define T6PPS0                        2726
#define T6PPS1                        2727
#define T6PPS2                        2728
#define T6PPS3                        2729
#define T6PPS4                        2730
#define ATCC1PPS                      2731
#define ATCC1PPS0                     2732
#define ATCC1PPS1                     2733
#define ATCC1PPS2                     2734
#define ATCC1PPS3                     2735
#define ATCC1PPS4                     2736
#define SSPCLKPPS                     2737
#define SSPCLKPPS0                    2738
#define SSPCLKPPS1                    2739
#define SSPCLKPPS2                    2740
#define SSPCLKPPS3                    2741
#define SSPCLKPPS4                    2742
#define SSPDATPPS                     2743
#define SSPDATPPS0                    2744
#define SSPDATPPS1                    2745
#define SSPDATPPS2                    2746
#define SSPDATPPS3                    2747
#define SSPDATPPS4                    2748
#define SSPSSPPS                      2749
#define SSPSSPPS0                     2750
#define SSPSSPPS1                     2751
#define SSPSSPPS2                     2752
#define SSPSSPPS3                     2753
#define SSPSSPPS4                     2754
#define ATCC2PPS                      2755
#define ATCC2PPS0                     2756
#define ATCC2PPS1                     2757
#define ATCC2PPS2                     2758
#define ATCC2PPS3                     2759
#define ATCC2PPS4                     2760
#define RXPPS                         2761
#define RXPPS0                        2762
#define RXPPS1                        2763
#define RXPPS2                        2764
