tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define RXPPS3                        2765
#define RXPPS4                        2766
#define CKPPS                         2767
#define CKPPS0                        2768
#define CKPPS1                        2769
#define CKPPS2                        2770
#define CKPPS3                        2771
#define CKPPS4                        2772
#define SMT1SIGPPS                    2773
#define SMT1SIGPPS0                   2774
#define SMT1SIGPPS1                   2775
#define SMT1SIGPPS2                   2776
#define SMT1SIGPPS3                   2777
#define SMT1SIGPPS4                   2778
#define SMT1WINPPS                    2779
#define SMTWINPPS0                    2780
#define SMTWINPPS1                    2781
#define SMTWINPPS2                    2782
#define SMTWINPPS3                    2783
#define SMTWINPPS4                    2784
#define CLCIN0PPS                     2785
#define CLCIN0PPS0                    2786
#define CLCIN0PPS1                    2787
#define CLCIN0PPS2                    2788
#define CLCIN0PPS3                    2789
#define CLCIN0PPS4                    2790
#define CLCIN1PPS                     2791
#define CLCIN1PPS0                    2792
#define CLCIN1PPS1                    2793
#define CLCIN1PPS2                    2794
#define CLCIN1PPS3                    2795
#define CLCIN1PPS4                    2796
#define CLCIN2PPS                     2797
#define CLCIN2PPS0                    2798
#define CLCIN2PPS1                    2799
#define CLCIN2PPS2                    2800
#define CLCIN2PPS3                    2801
#define CLCIN2PPS4                    2802
#define CLCIN3PPS                     2803
#define CLCIN3PPS0                    2804
#define CLCIN3PPS1                    2805
#define CLCIN3PPS2                    2806
#define CLCIN3PPS3                    2807
#define CLCIN3PPS4                    2808
#define SMT2SIGPPS                    2809
#define SMT2SIGPPS0                   2810
#define SMT2SIGPPS1                   2811
#define SMT2SIGPPS2                   2812
#define SMT2SIGPPS3                   2813
#define SMT2SIGPPS4                   2814
#define SMT2WINPPS                    2815
#define SMT2WINPPS0                   2816
#define SMT2WINPPS1                   2817
#define SMT2WINPPS2                   2818
#define SMT2WINPPS3                   2819
#define SMT2WINPPS4                   2820
#define ATCC3PPS                      2821
#define ATCC3PPS0                     2822
#define ATCC3PPS1                     2823
#define ATCC3PPS2                     2824
#define ATCC3PPS3                     2825
#define ATCC3PPS4                     2826
#define RA0PPS                        2827
#define RA0PPS0                       2828
#define RA0PPS1                       2829
#define RA0PPS2                       2830
#define RA0PPS3                       2831
#define RA0PPS4                       2832
#define RA1PPS                        2833
#define RA1PPS0                       2834
#define RA1PPS1                       2835
#define RA1PPS2                       2836
#define RA1PPS3                       2837
#define RA1PPS4                       2838
#define RA2PPS                        2839
#define RA2PPS0                       2840
#define RA2PPS1                       2841
#define RA2PPS2                       2842
#define RA2PPS3                       2843
#define RA2PPS4                       2844
#define RA4PPS                        2845
#define RA4PPS0                       2846
#define RA4PPS1                       2847
#define RA4PPS2                       2848
#define RA4PPS3                       2849
#define RA4PPS4                       2850
#define RA5PPS                        2851
#define RA5PPS0                       2852
#define RA5PPS1                       2853
#define RA5PPS2                       2854
#define RA5PPS3                       2855
#define RA5PPS4                       2856
#define RC0PPS                        2857
#define RC0PPS0                       2858
#define RC0PPS1                       2859
#define RC0PPS2                       2860
#define RC0PPS3                       2861
#define RC0PPS4                       2862
#define RC1PPS                        2863
#define RC1PPS0                       2864
#define RC1PPS1                       2865
#define RC1PPS2                       2866
#define RC1PPS3                       2867
#define RC1PPS4                       2868
#define RC2PPS                        2869
#define RC2PPS0                       2870
#define RC2PPS1                       2871
#define RC2PPS2                       2872
#define RC2PPS3                       2873
#define RC2PPS4                       2874
#define RC3PPS                        2875
#define RC3PPS0                       2876
#define RC3PPS1                       2877
#define RC3PPS2                       2878
#define RC3PPS3                       2879
#define RC3PPS4                       2880
#define RC4PPS                        2881
#define RC4PPS0                       2882
#define RC4PPS1                       2883
#define RC4PPS2                       2884
#define RC4PPS3                       2885
#define RC4PPS4                       2886
#define RC5PPS                        2887
#define RC5PPS0                       2888
#define RC5PPS1                       2889
#define RC5PPS2                       2890
#define RC5PPS3                       2891
#define RC5PPS4                       2892
#define CLCDATA                       2893
#define MLC1OUT                       2894
#define MLC2OUT                       2895
#define MLC3OUT                       2896
#define MLC4OUT                       2897
#define CLC1CON                       2898
#define CLC1CON_MODE                  2899
#define LC1MODE0                      2900
#define LC1MODE                       2901
#define CLC1CON_MODE0                 2902
#define LC1MODE1                      2903
#define CLC1CON_MODE1                 2904
#define LC1MODE2                      2905
#define CLC1CON_MODE2                 2906
#define LC1INTN                       2907
#define CLC1CON_INTN                  2908
#define LC1INTP                       2909
#define CLC1CON_INTP                  2910
#define LC1OUT                        2911
#define CLC1CON_OUT                   2912
#define LC1EN                         2913
#define CLC1CON_EN                    2914
#define CLC1POL                       2915
#define LC1G1POL                      2916
#define CLC1POL_G1POL                 2917
#define CLC1POL_G2POL                 2918
#define LC1G2POL                      2919
#define LC1G3POL                      2920
#define CLC1POL_G3POL                 2921
#define LC1G4POL                      2922
#define CLC1POL_G4POL                 2923
#define CLC1POL_POL                   2924
#define LC1POL                        2925
#define CLC1SEL0                      2926
#define CLC1SEL0_D1S0                 2927
#define LC1D1S0                       2928
#define CLC1SEL0_D1S                  2929
#define LC1D1S                        2930
#define CLC1SEL0_D1S1                 2931
#define LC1D1S1                       2932
#define CLC1SEL0_D1S2                 2933
#define LC1D1S2                       2934
#define LC1D1S3                       2935
#define CLC1SEL0_D1S3                 2936
#define CLC1SEL0_D1S4                 2937
#define LC1D1S4                       2938
#define CLC1SEL0_D1S5                 2939
#define LC1D1S5                       2940
#define CLC1SEL1                      2941
#define CLC1SEL1_D2S0                 2942
#define CLC1SEL1_D2S                  2943
#define LC1D2S                        2944
#define LC1D2S0                       2945
#define CLC1SEL1_D2S1                 2946
#define LC1D2S1                       2947
#define CLC1SEL1_D2S2                 2948
#define LC1D2S2                       2949
#define LC1D2S3                       2950
#define CLC1SEL1_D2S3                 2951
#define LC1D2S4                       2952
#define CLC1SEL1_D2S4                 2953
#define LC1D2S5                       2954
#define CLC1SEL1_D2S5                 2955
#define CLC1SEL2                      2956
#define LC1D3S0                       2957
#define CLC1SEL2_D3S                  2958
#define LC1D3S                        2959
#define CLC1SEL2_D3S0                 2960
#define LC1D3S1                       2961
#define CLC1SEL2_D3S1                 2962
#define LC1D3S2                       2963
#define CLC1SEL2_D3S2                 2964
#define LC1D3S3                       2965
#define CLC1SEL2_D3S3                 2966
#define LC1D3S4                       2967
#define CLC1SEL2_D3S4                 2968
#define LC1D3S5                       2969
#define CLC1SEL2_D3S5                 2970
#define CLC1SEL3                      2971
#define CLC1SEL3_D4S                  2972
#define LC1D4S                        2973
#define LC1D4S0                       2974
#define CLC1SEL3_D4S0                 2975
#define CLC1SEL3_D4S1                 2976
#define LC1D4S1                       2977
#define LC1D4S2                       2978
#define CLC1SEL3_D4S2                 2979
#define LC1D4S3                       2980
#define CLC1SEL3_D4S3                 2981
#define LC1D4S4                       2982
#define CLC1SEL3_D4S4                 2983
#define LC1D4S5                       2984
#define CLC1SEL3_D4S5                 2985
#define CLC1GLS0                      2986
#define CLC1GLS0_D1N                  2987
#define LC1G1D1N                      2988
#define CLC1GLS0_D1T                  2989
#define LC1G1D1T                      2990
#define LC1G1D2N                      2991
#define CLC1GLS0_D2N                  2992
#define LC1G1D2T                      2993
#define CLC1GLS0_D2T                  2994
#define CLC1GLS0_D3N                  2995
#define LC1G1D3N                      2996
#define CLC1GLS0_D3T                  2997
#define LC1G1D3T                      2998
#define CLC1GLS0_D4N                  2999
#define LC1G1D4N                      3000
#define CLC1GLS0_D4T                  3001
#define LC1G1D4T                      3002
#define CLC1GLS1                      3003
#define CLC1GLS1_D1N                  3004
#define LC1G2D1N                      3005
#define LC1G2D1T                      3006
#define CLC1GLS1_D1T                  3007
#define CLC1GLS1_D2N                  3008
#define LC1G2D2N                      3009
#define LC1G2D2T                      3010
#define CLC1GLS1_D2T                  3011
#define CLC1GLS1_D3N                  3012
#define LC1G2D3N                      3013
#define LC1G2D3T                      3014
#define CLC1GLS1_D3T                  3015
#define CLC1GLS1_D4N                  3016
#define LC1G2D4N                      3017
#define LC1G2D4T                      3018
#define CLC1GLS1_D4T                  3019
#define CLC1GLS2                      3020
#define CLC1GLS2_D1N                  3021
#define LC1G3D1N                      3022
#define LC1G3D1T                      3023
#define CLC1GLS2_D1T                  3024
#define LC1G3D2N                      3025
#define CLC1GLS2_D2N                  3026
#define LC1G3D2T                      3027
#define CLC1GLS2_D2T                  3028
#define CLC1GLS2_D3N                  3029
#define LC1G3D3N                      3030
#define LC1G3D3T                      3031
#define CLC1GLS2_D3T                  3032
#define LC1G3D4N                      3033
#define CLC1GLS2_D4N                  3034
#define LC1G3D4T                      3035
#define CLC1GLS2_D4T                  3036
#define CLC1GLS3                      3037
#define LC1G4D1N                      3038
#define CLC1GLS3_G4D1N                3039
#define LC1G4D1T                      3040
#define CLC1GLS3_G4D1T                3041
#define CLC1GLS3_G4D2N                3042
#define LC1G4D2N                      3043
#define CLC1GLS3_G4D2T                3044
#define LC1G4D2T                      3045
#define LC1G4D3N                      3046
#define CLC1GLS3_G4D3N                3047
#define LC1G4D3T                      3048
#define CLC1GLS3_G4D3T                3049
#define CLC1GLS3_G4D4N                3050
#define LC1G4D4N                      3051
#define CLC1GLS3_G4D4T                3052
#define LC1G4D4T                      3053
#define CLC2CON                       3054
#define LC2MODE0                      3055
#define CLC2CON_MODE                  3056
#define LC2MODE                       3057
#define CLC2CON_MODE0                 3058
#define LC2MODE1                      3059
#define CLC2CON_MODE1                 3060
#define LC2MODE2                      3061
#define CLC2CON_MODE2                 3062
#define LC2INTN                       3063
#define CLC2CON_INTN                  3064
#define LC2INTP                       3065
#define CLC2CON_INTP                  3066
#define CLC2CON_OUT                   3067
#define LC2OUT                        3068
#define CLC2CON_EN                    3069
#define LC2EN                         3070
#define CLC2POL                       3071
#define LC2G1POL                      3072
#define CLC2POL_G1POL                 3073
#define LC2G2POL                      3074
#define CLC2POL_G2POL                 3075
#define LC2G3POL                      3076
#define CLC2POL_G3POL                 3077
#define LC2G4POL                      3078
#define CLC2POL_G4POL                 3079
#define CLC2POL_POL                   3080
#define LC2POL                        3081
#define CLC2SEL0                      3082
#define CLC2SEL0_D1S                  3083
#define LC2D1S0                       3084
#define CLC2SEL0_D1S0                 3085
#define LC2D1S                        3086
#define LC2D1S1                       3087
#define CLC2SEL0_D1S1                 3088
#define LC2D1S2                       3089
#define CLC2SEL0_D1S2                 3090
#define CLC2SEL0_D1S3                 3091
#define LC2D1S3                       3092
#define LC2D1S4                       3093
#define CLC2SEL0_D1S4                 3094
#define LC2D1S5                       3095
#define CLC2SEL0_D1S5                 3096
#define CLC2SEL1                      3097
#define LC2D2S0                       3098
#define CLC2SEL1_D2S0                 3099
#define LC2D2S                        3100
#define CLC2SEL1_D2S                  3101
#define LC2D2S1                       3102
#define CLC2SEL1_D2S1                 3103
#define LC2D2S2                       3104
#define CLC2SEL1_D2S2                 3105
#define LC2D2S3                       3106
#define CLC2SEL1_D2S3                 3107
#define LC2D2S4                       3108
#define CLC2SEL1_D2S4                 3109
#define LC2D2S5                       3110
#define CLC2SEL1_D2S5                 3111
#define CLC2SEL2                      3112
#define CLC2SEL2_D3S                  3113
#define LC2D3S0                       3114
#define CLC2SEL2_D3S0                 3115
#define LC2D3S                        3116
#define CLC2SEL2_D3S1                 3117
#define LC2D3S1                       3118
#define LC2D3S2                       3119
#define CLC2SEL2_D3S2                 3120
#define LC2D3S3                       3121
#define CLC2SEL2_D3S3                 3122
#define LC2D3S4                       3123
#define CLC2SEL2_D3S4                 3124
#define LC2D3S5                       3125
#define CLC2SEL2_D3S5                 3126
#define CLC2SEL3                      3127
#define LC2D4S0                       3128
#define CLC2SEL3_D4S                  3129
#define CLC2SEL3_D4S0                 3130
#define LC2D4S                        3131
#define LC2D4S1                       3132
#define CLC2SEL3_D4S1                 3133
#define LC2D4S2                       3134
#define CLC2SEL3_D4S2                 3135
#define CLC2SEL3_D4S3                 3136
#define LC2D4S3                       3137
#define LC2D4S4                       3138
#define CLC2SEL3_D4S4                 3139
#define LC2D4S5                       3140
#define CLC2SEL3_D4S5                 3141
#define CLC2GLS0                      3142
#define LC2G1D1N                      3143
#define CLC2GLS0_D1N                  3144
#define CLC2GLS0_D1T                  3145
#define LC2G1D1T                      3146
#define LC2G1D2N                      3147
#define CLC2GLS0_D2N                  3148
#define CLC2GLS0_D2T                  3149
#define LC2G1D2T                      3150
#define LC2G1D3N                      3151
#define CLC2GLS0_D3N                  3152
#define CLC2GLS0_D3T                  3153
#define LC2G1D3T                      3154
#define LC2G1D4N                      3155
#define CLC2GLS0_D4N                  3156
#define CLC2GLS0_D4T                  3157
#define LC2G1D4T                      3158
#define CLC2GLS1                      3159
#define CLC2GLS1_D1N                  3160
#define LC2G2D1N                      3161
#define CLC2GLS1_D1T                  3162
#define LC2G2D1T                      3163
#define CLC2GLS1_D2N                  3164
#define LC2G2D2N                      3165
#define CLC2GLS1_D2T                  3166
#define LC2G2D2T                      3167
#define LC2G2D3N                      3168
#define CLC2GLS1_D3N                  3169
#define LC2G2D3T                      3170
#define CLC2GLS1_D3T                  3171
#define LC2G2D4N                      3172
#define CLC2GLS1_D4N                  3173
#define LC2G2D4T                      3174
#define CLC2GLS1_D4T                  3175
#define CLC2GLS2                      3176
#define LC2G3D1N                      3177
#define CLC2GLS2_D1N                  3178
#define CLC2GLS2_D1T                  3179
#define LC2G3D1T                      3180
#define CLC2GLS2_D2N                  3181
#define LC2G3D2N                      3182
#define LC2G3D2T                      3183
#define CLC2GLS2_D2T                  3184
#define CLC2GLS2_D3N                  3185
#define LC2G3D3N                      3186
#define CLC2GLS2_D3T                  3187
#define LC2G3D3T                      3188
#define CLC2GLS2_D4N                  3189
#define LC2G3D4N                      3190
#define LC2G3D4T                      3191
#define CLC2GLS2_D4T                  3192
#define CLC2GLS3                      3193
#define LC2G4D1N                      3194
#define CLC2GLS3_G4D1N                3195
#define CLC2GLS3_G4D1T                3196
#define LC2G4D1T                      3197
#define CLC2GLS3_G4D2N                3198
#define LC2G4D2N                      3199
#define LC2G4D2T                      3200
#define CLC2GLS3_G4D2T                3201
#define CLC2GLS3_G4D3N                3202
#define LC2G4D3N                      3203
#define CLC2GLS3_G4D3T                3204
#define LC2G4D3T                      3205
#define LC2G4D4N                      3206
#define CLC2GLS3_G4D4N                3207
#define CLC2GLS3_G4D4T                3208
#define LC2G4D4T                      3209
#define CLC3CON                       3210
#define LC3MODE0                      3211
#define CLC3CON_MODE0                 3212
#define CLC3CON_MODE                  3213
#define LC3MODE                       3214
#define LC3MODE1                      3215
#define CLC3CON_MODE1                 3216
#define LC3MODE2                      3217
#define CLC3CON_MODE2                 3218
#define LC3INTN                       3219
#define CLC3CON_INTN                  3220
#define CLC3CON_INTP                  3221
#define LC3INTP                       3222
#define CLC3CON_OUT                   3223
#define LC3OUT                        3224
#define LC3EN                         3225
#define CLC3CON_EN                    3226
#define CLC3POL                       3227
#define LC3G1POL                      3228
#define CLC3POL_G1POL                 3229
#define LC3G2POL                      3230
#define CLC3POL_G2POL                 3231
#define CLC3POL_G3POL                 3232
#define LC3G3POL                      3233
#define LC3G4POL                      3234
#define CLC3POL_G4POL                 3235
#define LC3POL                        3236
#define CLC3POL_POL                   3237
#define CLC3SEL0                      3238
#define CLC3SEL0_D1S0                 3239
#define LC3D1S0                       3240
#define CLC3SEL0_D1S                  3241
#define LC3D1S                        3242
#define LC3D1S1                       3243
#define CLC3SEL0_D1S1                 3244
#define LC3D1S2                       3245
#define CLC3SEL0_D1S2                 3246
#define LC3D1S3                       3247
#define CLC3SEL0_D1S3                 3248
#define LC3D1S4                       3249
#define CLC3SEL0_D1S4                 3250
#define LC3D1S5                       3251
#define CLC3SEL0_D1S5                 3252
#define CLC3SEL1                      3253
#define CLC3SEL1_D2S                  3254
#define CLC3SEL1_D2S0                 3255
#define LC3D2S                        3256
#define LC3D2S0                       3257
#define CLC3SEL1_D2S1                 3258
#define LC3D2S1                       3259
#define CLC3SEL1_D2S2                 3260
#define LC3D2S2                       3261
#define CLC3SEL1_D2S3                 3262
#define LC3D2S3                       3263
#define CLC3SEL1_D2S4                 3264
#define LC3D2S4                       3265
#define CLC3SEL1_D2S5                 3266
#define LC3D2S5                       3267
#define CLC3SEL2                      3268
#define LC3D3S                        3269
#define CLC3SEL2_D3S                  3270
#define LC3D3S0                       3271
#define CLC3SEL2_D3S0                 3272
#define LC3D3S1                       3273
#define CLC3SEL2_D3S1                 3274
#define LC3D3S2                       3275
#define CLC3SEL2_D3S2                 3276
#define LC3D3S3                       3277
#define CLC3SEL2_D3S3                 3278
#define CLC3SEL2_D3S4                 3279
#define LC3D3S4                       3280
#define CLC3SEL2_D3S5                 3281
#define LC3D3S5                       3282
#define CLC3SEL3                      3283
#define CLC3SEL3_D4S0                 3284
#define LC3D4S0                       3285
#define CLC3SEL3_D4S                  3286
#define LC3D4S                        3287
#define LC3D4S1                       3288
#define CLC3SEL3_D4S1                 3289
#define LC3D4S2                       3290
#define CLC3SEL3_D4S2                 3291
#define LC3D4S3                       3292
#define CLC3SEL3_D4S3                 3293
#define LC3D4S4                       3294
#define CLC3SEL3_D4S4                 3295
#define LC3D4S5                       3296
#define CLC3SEL3_D4S5                 3297
#define CLC3GLS0                      3298
#define CLC3GLS0_D1N                  3299
#define LC3G1D1N                      3300
#define LC3G1D1T                      3301
#define CLC3GLS0_D1T                  3302
#define LC3G1D2N                      3303
#define CLC3GLS0_D2N                  3304
#define CLC3GLS0_D2T                  3305
#define LC3G1D2T                      3306
#define CLC3GLS0_D3N                  3307
#define LC3G1D3N                      3308
#define LC3G1D3T                      3309
#define CLC3GLS0_D3T                  3310
#define CLC3GLS0_D4N                  3311
#define LC3G1D4N                      3312
#define CLC3GLS0_D4T                  3313
#define LC3G1D4T                      3314
#define CLC3GLS1                      3315
#define LC3G2D1N                      3316
#define CLC3GLS1_D1N                  3317
#define CLC3GLS1_D1T                  3318
#define LC3G2D1T                      3319
#define LC3G2D2N                      3320
#define CLC3GLS1_D2N                  3321
#define LC3G2D2T                      3322
