tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1615_tdd.h
#define CLC3GLS1_D2T                  3323
#define LC3G2D3N                      3324
#define CLC3GLS1_D3N                  3325
#define CLC3GLS1_D3T                  3326
#define LC3G2D3T                      3327
#define LC3G2D4N                      3328
#define CLC3GLS1_D4N                  3329
#define LC3G2D4T                      3330
#define CLC3GLS1_D4T                  3331
#define CLC3GLS2                      3332
#define LC3G3D1N                      3333
#define CLC3GLS2_D1N                  3334
#define LC3G3D1T                      3335
#define CLC3GLS2_D1T                  3336
#define CLC3GLS2_D2N                  3337
#define LC3G3D2N                      3338
#define CLC3GLS2_D2T                  3339
#define LC3G3D2T                      3340
#define CLC3GLS2_D3N                  3341
#define LC3G3D3N                      3342
#define LC3G3D3T                      3343
#define CLC3GLS2_D3T                  3344
#define CLC3GLS2_D4N                  3345
#define LC3G3D4N                      3346
#define CLC3GLS2_D4T                  3347
#define LC3G3D4T                      3348
#define CLC3GLS3                      3349
#define LC3G4D1N                      3350
#define CLC3GLS3_G4D1N                3351
#define LC3G4D1T                      3352
#define CLC3GLS3_G4D1T                3353
#define LC3G4D2N                      3354
#define CLC3GLS3_G4D2N                3355
#define CLC3GLS3_G4D2T                3356
#define LC3G4D2T                      3357
#define LC3G4D3N                      3358
#define CLC3GLS3_G4D3N                3359
#define CLC3GLS3_G4D3T                3360
#define LC3G4D3T                      3361
#define LC3G4D4N                      3362
#define CLC3GLS3_G4D4N                3363
#define LC3G4D4T                      3364
#define CLC3GLS3_G4D4T                3365
#define CLC4CON                       3366
#define LC4MODE                       3367
#define CLC4CON_MODE                  3368
#define LC4MODE0                      3369
#define CLC4CON_MODE0                 3370
#define LC4MODE1                      3371
#define CLC4CON_MODE1                 3372
#define LC4MODE2                      3373
#define CLC4CON_MODE2                 3374
#define LC4INTN                       3375
#define CLC4CON_INTN                  3376
#define CLC4CON_INTP                  3377
#define LC4INTP                       3378
#define CLC4CON_OUT                   3379
#define LC4OUT                        3380
#define CLC4CON_EN                    3381
#define LC4EN                         3382
#define CLC4POL                       3383
#define CLC4POL_G1POL                 3384
#define LC4G1POL                      3385
#define CLC4POL_G2POL                 3386
#define LC4G2POL                      3387
#define CLC4POL_G3POL                 3388
#define LC4G3POL                      3389
#define LC4G4POL                      3390
#define CLC4POL_G4POL                 3391
#define LC4POL                        3392
#define CLC4POL_POL                   3393
#define CLC4SEL0                      3394
#define CLC4SEL0_D1S0                 3395
#define LC4D1S0                       3396
#define CLC4SEL0_D1S                  3397
#define LC4D1S                        3398
#define CLC4SEL0_D1S1                 3399
#define LC4D1S1                       3400
#define CLC4SEL0_D1S2                 3401
#define LC4D1S2                       3402
#define CLC4SEL0_D1S3                 3403
#define LC4D1S3                       3404
#define CLC4SEL0_D1S4                 3405
#define LC4D1S4                       3406
#define CLC4SEL0_D1S5                 3407
#define LC4D1S5                       3408
#define CLC4SEL1                      3409
#define LC4D2S0                       3410
#define CLC4SEL1_D2S                  3411
#define CLC4SEL1_D2S0                 3412
#define LC4D2S                        3413
#define CLC4SEL1_D2S1                 3414
#define LC4D2S1                       3415
#define LC4D2S2                       3416
#define CLC4SEL1_D2S2                 3417
#define LC4D2S3                       3418
#define CLC4SEL1_D2S3                 3419
#define LC4D2S4                       3420
#define CLC4SEL1_D2S4                 3421
#define LC4D2S5                       3422
#define CLC4SEL1_D2S5                 3423
#define CLC4SEL2                      3424
#define LC4D3S                        3425
#define CLC4SEL2_D3S                  3426
#define CLC4SEL2_D3S0                 3427
#define LC4D3S0                       3428
#define LC4D3S1                       3429
#define CLC4SEL2_D3S1                 3430
#define CLC4SEL2_D3S2                 3431
#define LC4D3S2                       3432
#define CLC4SEL2_D3S3                 3433
#define LC4D3S3                       3434
#define CLC4SEL2_D3S4                 3435
#define LC4D3S4                       3436
#define CLC4SEL2_D3S5                 3437
#define LC4D3S5                       3438
#define CLC4SEL3                      3439
#define LC4D4S0                       3440
#define LC4D4S                        3441
#define CLC4SEL3_D4S0                 3442
#define CLC4SEL3_D4S                  3443
#define LC4D4S1                       3444
#define CLC4SEL3_D4S1                 3445
#define LC4D4S2                       3446
#define CLC4SEL3_D4S2                 3447
#define LC4D4S3                       3448
#define CLC4SEL3_D4S3                 3449
#define LC4D4S4                       3450
#define CLC4SEL3_D4S4                 3451
#define LC4D4S5                       3452
#define CLC4SEL3_D4S5                 3453
#define CLC4GLS0                      3454
#define CLC4GLS0_D1N                  3455
#define LC4G1D1N                      3456
#define CLC4GLS0_D1T                  3457
#define LC4G1D1T                      3458
#define CLC4GLS0_D2N                  3459
#define LC4G1D2N                      3460
#define CLC4GLS0_D2T                  3461
#define LC4G1D2T                      3462
#define CLC4GLS0_D3N                  3463
#define LC4G1D3N                      3464
#define CLC4GLS0_D3T                  3465
#define LC4G1D3T                      3466
#define CLC4GLS0_D4N                  3467
#define LC4G1D4N                      3468
#define CLC4GLS0_D4T                  3469
#define LC4G1D4T                      3470
#define CLC4GLS1                      3471
#define CLC4GLS1_D1N                  3472
#define LC4G2D1N                      3473
#define CLC4GLS1_D1T                  3474
#define LC4G2D1T                      3475
#define LC4G2D2N                      3476
#define CLC4GLS1_D2N                  3477
#define LC4G2D2T                      3478
#define CLC4GLS1_D2T                  3479
#define CLC4GLS1_D3N                  3480
#define LC4G2D3N                      3481
#define LC4G2D3T                      3482
#define CLC4GLS1_D3T                  3483
#define CLC4GLS1_D4N                  3484
#define LC4G2D4N                      3485
#define CLC4GLS1_D4T                  3486
#define LC4G2D4T                      3487
#define CLC4GLS2                      3488
#define CLC4GLS2_D1N                  3489
#define LC4G3D1N                      3490
#define CLC4GLS2_D1T                  3491
#define LC4G3D1T                      3492
#define LC4G3D2N                      3493
#define CLC4GLS2_D2N                  3494
#define LC4G3D2T                      3495
#define CLC4GLS2_D2T                  3496
#define CLC4GLS2_D3N                  3497
#define LC4G3D3N                      3498
#define CLC4GLS2_D3T                  3499
#define LC4G3D3T                      3500
#define LC4G3D4N                      3501
#define CLC4GLS2_D4N                  3502
#define LC4G3D4T                      3503
#define CLC4GLS2_D4T                  3504
#define CLC4GLS3                      3505
#define CLC4GLS3_G4D1N                3506
#define LC4G4D1N                      3507
#define LC4G4D1T                      3508
#define CLC4GLS3_G4D1T                3509
#define LC4G4D2N                      3510
#define CLC4GLS3_G4D2N                3511
#define LC4G4D2T                      3512
#define CLC4GLS3_G4D2T                3513
#define CLC4GLS3_G4D3N                3514
#define LC4G4D3N                      3515
#define CLC4GLS3_G4D3T                3516
#define LC4G4D3T                      3517
#define LC4G4D4N                      3518
#define CLC4GLS3_G4D4N                3519
#define LC4G4D4T                      3520
#define CLC4GLS3_G4D4T                3521
#define STATUS_SHAD                   3522
#define C_SHAD                        3523
#define DC_SHAD                       3524
#define Z_SHAD                        3525
#define WREG_SHAD                     3526
#define BSR_SHAD                      3527
#define PCLATH_SHAD                   3528
#define FSR0L_SHAD                    3529
#define FSR0H_SHAD                    3530
#define FSR1L_SHAD                    3531
#define FSR1H_SHAD                    3532
#define STKPTR                        3533
#define TOSL                          3534
#define TOSH                          3535

#endif // _PIC16LF1615_H_
